---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /bplimext/projects/p068_SilvaSantosGouveia/work_area/Log_4_Robustness.log
  log type:  text
 opened on:  29 Dec 2020, 22:07:39
r; t=0.00 22:07:39

. 
. 
. use "/bplimext/projects/p068_SilvaSantosGouveia/work_area/finaldb.dta", clear
(CB Panel 2006-2018 - Ref. 2020_06 - YFRM/Rosto (V01) - Anonymized - PE068)
r; t=0.95 22:07:39

. 
. xtset tina ano
       panel variable:  tina (unbalanced)
        time variable:  ano, 2006 to 2018, but with gaps
                delta:  1 unit
r; t=1.71 22:07:41

. 
. 
. *************** DIFFERENT MATCHING METHODS***********
. *************** DIFFERENT MATCHING METHODS***********
. *************** DIFFERENT MATCHING METHODS***********
. set seed 636299
r; t=0.00 22:07:41

. 
. ***********RESULTS WITHOUT ABADIE IMBENS SE BOOTSTRAPPED 200 TIMES********
. *OUTCOME VARIABLE: Financing
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) 
> logit neighbor(2) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     23,498
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(financing) logit neighbor(2) caliper(0.001)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .2009384    .130788     1.54   0.124    -.0554013    .4572781
------------------------------------------------------------------------------
r; t=57.60 22:08:39

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .27663     11.2 |   1.44  0.150 |  1.00
longcreditpc07          | .32695   .29049      8.8 |   1.05  0.296 |  1.04
cae3                    |  37802    37949     -0.7 |  -0.09  0.926 |  0.98
age07                   | 23.786   24.562     -7.0 |  -0.79  0.427 |  0.77*
debtassetr07            | .25434   .24284      3.6 |   0.65  0.514 |  0.84
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.005      3.74    0.587      6.3       7.0      16.5    0.87      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.07 22:08:46

. 
. *OUTCOME VARIABLE: total_assets
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit neig
> hbor(1) caliper(0.001) common ties
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     52,772
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07, outcome(t_assets1318) logit neighbor(1) caliper(0.001) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .1096525   .0603647     1.82   0.069    -.0086603    .2279652
------------------------------------------------------------------------------
r; t=101.14 22:10:27

. 
. pstest collateral07 longcreditpc07 cae3 age07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .27473      8.0 |   1.12  0.264 |  0.91
longcreditpc07          | .29759   .26097      9.2 |   1.22  0.224 |  1.06
cae3                    |  38264    37525      3.7 |   0.52  0.601 |  0.94
age07                   |  23.41   24.017     -5.4 |  -0.74  0.459 |  0.86
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.63    0.459      6.6       6.7      14.3    1.02       0
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=5.88 22:10:33

. 
. *OUTCOME VARIABLE: fixed_assets
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets131
> 8) logit neighbor(1) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     47,396
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(f_assets1318) logit neighbor(1) caliper(0.001)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .1201814    .111065     1.08   0.279     -.097502    .3378647
------------------------------------------------------------------------------
r; t=94.07 22:12:07

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .27924      8.2 |   1.11  0.268 |  0.83
longcreditpc07          | .30333    .2866      4.2 |   0.54  0.592 |  0.97
cae3                    |  38220    37932      1.4 |   0.20  0.842 |  0.93
age07                   | 23.552   23.863     -2.8 |  -0.38  0.703 |  0.94
debtassetr07            | .24311   .23688      1.8 |   0.36  0.718 |  0.62*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.68    0.891      3.7       2.8       9.9    0.83      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.41 22:12:13

. 
. 
. *OUTCOME VARIABLE: laborprod
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod13
> 18) logit neighbor(1) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     47,729
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(laborprod1318) logit neighbor(1) caliper(0.001)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.0733893   .0483475    -1.52   0.129    -.1681487    .0213701
------------------------------------------------------------------------------
r; t=94.71 22:13:48

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589    .2668     12.7 |   1.76  0.078 |  0.94
longcreditpc07          |  .2961   .27486      5.3 |   0.69  0.489 |  1.00
cae3                    |  37927    37334      2.9 |   0.41  0.680 |  0.91
age07                   | 23.402   24.069     -5.9 |  -0.77  0.444 |  0.73*
debtassetr07            | .24454   .24169      0.8 |   0.16  0.873 |  0.56*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      4.09    0.537      5.5       5.3      15.4    0.88      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.49 22:13:55

. 
. 
. *OUTCOME VARIABLE: levpetTFP 
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP13
> 18) logit neighbor(1) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     45,033
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(levpetTFP1318) logit neighbor(1) caliper(0.001)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .0021235   .0031039     0.68   0.494    -.0039601    .0082071
------------------------------------------------------------------------------
r; t=89.87 22:15:24

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .29027      3.4 |   0.47  0.641 |  0.96
longcreditpc07          | .30133   .25922     10.5 |   1.37  0.171 |  1.05
cae3                    |  37971    37230      3.6 |   0.51  0.609 |  0.94
age07                   | 23.512   24.141     -5.6 |  -0.72  0.470 |  0.76*
debtassetr07            | .24417   .24993     -1.7 |  -0.29  0.772 |  0.42*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.43    0.633      5.0       3.6      14.2    1.01      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.64 22:15:31

. 
. *OUTCOME VARIABLE: employment
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1
> 318) logit neighbor(1) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     48,712
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(employment1318) logit neighbor(1)
                    caliper(0.001) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .0779053   .0404446     1.93   0.054    -.0013646    .1571752
------------------------------------------------------------------------------
r; t=96.25 22:17:07

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .28414      4.5 |   0.60  0.546 |  0.81
longcreditpc07          | .29727    .2618      8.9 |   1.17  0.244 |  1.03
cae3                    |  37966    37346      3.1 |   0.43  0.665 |  0.91
age07                   | 23.411   23.664     -2.2 |  -0.30  0.765 |  0.79*
debtassetr07            | .24328    .2503     -2.0 |  -0.33  0.739 |  0.34*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.31    0.805      4.1       3.1      11.5    0.90      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.59 22:17:14

. 
. *OUTCOME VARIABLE: avg_wages
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages131
> 8) logit neighbor(1) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     45,433
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(avgwages1318) logit neighbor(1) caliper(0.001)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.0214139   .0434923    -0.49   0.622    -.1066572    .0638294
------------------------------------------------------------------------------
r; t=88.79 22:18:43

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .27457      9.6 |   1.32  0.187 |  0.96
longcreditpc07          | .30348   .28674      4.2 |   0.53  0.596 |  0.97
cae3                    |  37992    37331      3.3 |   0.46  0.648 |  0.94
age07                   | 23.537   25.171    -14.4 |  -1.77  0.076 |  0.64*
debtassetr07            | .24136   .19895     12.1 |   2.72  0.007 |  0.88
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.012     11.44    0.043      8.7       9.6      26.0*    0.70     20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.75 22:18:49

. 
. *OUTCOME VARIABLE: ebitda
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318)
>  logit neighbor(1) caliper(0.001) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     46,817
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(ebitda1318) logit neighbor(1) caliper(0.001)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.0804762   .1010633    -0.80   0.426    -.2785567    .1176043
------------------------------------------------------------------------------
r; t=92.66 22:20:22

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779   .27945      7.9 |   1.08  0.278 |  0.94
longcreditpc07          | .29616   .26986      6.6 |   0.84  0.403 |  1.00
cae3                    |  38382    38116      1.3 |   0.18  0.855 |  0.93
age07                   | 23.124   22.703      3.8 |   0.52  0.606 |  0.91
debtassetr07            | .24138   .22403      4.9 |   0.75  0.456 |  0.28*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.003      2.44    0.785      4.9       4.9      12.2    0.86      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.59 22:20:29

. 
. ********* 5 NEAREST-NEIGHBORS**********
. ********* 5 NEAREST-NEIGHBORS**********
. ********* 5 NEAREST-NEIGHBORS**********
. * Financing
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) logit neighbor(5) caliper(0.001) common
>  ties ai(14)

Logistic regression                             Number of obs     =     23,498
                                                LR chi2(5)        =      48.42
                                                Prob > chi2       =     0.0000
Log likelihood = -1476.7812                     Pseudo R2         =     0.0161

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.2177492   .2615744    -0.83   0.405    -.7304256    .2949272
longcreditpc07 |   .1609716   .1486454     1.08   0.279    -.1303679    .4523112
          cae3 |  -.0000194   2.96e-06    -6.55   0.000    -.0000252   -.0000136
         age07 |   -.000236   .0051232    -0.05   0.963    -.0102774    .0098053
  debtassetr07 |  -.2807261   .2469456    -1.14   0.256    -.7647305    .2032783
         _cons |  -3.521446    .214183   -16.44   0.000    -3.941237   -3.101655
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       financing  Unmatched | .451907135   .194649627   .257257507   .088745501     2.90
                        ATT | .451907135   .254315881   .197591254   .085391766     2.31
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    23,222 |    23,222 
   Treated |       276 |       276 
-----------+-----------+----------
     Total |    23,498 |    23,498 
r; t=14.46 22:20:43

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .28606      7.2 |   0.91  0.366 |  0.94
longcreditpc07          | .32695   .28377     10.5 |   1.24  0.214 |  1.05
cae3                    |  37802    37843     -0.2 |  -0.03  0.979 |  0.97
age07                   | 23.786   24.259     -4.2 |  -0.50  0.620 |  0.84
debtassetr07            | .25434   .23924      4.7 |   0.84  0.399 |  0.79
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      2.73    0.742      5.4       4.7      14.1    0.83       0
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.82 22:20:50

. 
. 
. * Total assets
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit neighbor(5) caliper(0.001) common ties ai(1
> 4)

Logistic regression                             Number of obs     =     52,772
                                                LR chi2(4)        =      82.15
                                                Prob > chi2       =     0.0000
Log likelihood = -2083.3085                     Pseudo R2         =     0.0193

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1197925   .2221053     0.54   0.590    -.3155259     .555111
longcreditpc07 |   .3071381   .1279497     2.40   0.016     .0563612     .557915
          cae3 |  -.0000213   2.52e-06    -8.47   0.000    -.0000263   -.0000164
         age07 |  -.0037951   .0046019    -0.82   0.410    -.0128146    .0052244
         _cons |   -4.10162   .1801391   -22.77   0.000    -4.454686   -3.748554
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    t_assets1318  Unmatched | .316437627   .224222756   .092214871   .035600443     2.59
                        ATT | .316437627   .236447427     .0799902   .030343374     2.64
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    52,418 |    52,418 
   Treated |       354 |       354 
-----------+-----------+----------
     Total |    52,772 |    52,772 
r; t=18.41 22:21:08

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .27253      8.9 |   1.24  0.215 |  0.88
longcreditpc07          | .29759    .2653      8.1 |   1.07  0.285 |  1.04
cae3                    |  38264    37672      2.9 |   0.42  0.676 |  0.93
age07                   |  23.41   23.473     -0.6 |  -0.08  0.939 |  0.85
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.003      2.78    0.596      5.1       5.5      12.5    0.95       0
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=5.81 22:21:14

. 
. 
. *FIXED ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets1318) logit neighbor(5) caliper(0.001) com
> mon ties ai(14)

Logistic regression                             Number of obs     =     47,396
                                                LR chi2(5)        =      73.87
                                                Prob > chi2       =     0.0000
Log likelihood = -2000.2397                     Pseudo R2         =     0.0181

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0135032   .2302872    -0.06   0.953    -.4648578    .4378514
longcreditpc07 |   .3190963    .132046     2.42   0.016     .0602909    .5779018
          cae3 |  -.0000205   2.55e-06    -8.03   0.000    -.0000255   -.0000155
         age07 |  -.0043119   .0046719    -0.92   0.356    -.0134687     .004845
  debtassetr07 |  -.0845762   .1806224    -0.47   0.640    -.4385897    .2694373
         _cons |   -3.99814   .1869652   -21.38   0.000    -4.364585   -3.631695
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    f_assets1318  Unmatched | .402127207   .264362226   .137764981   .075933176     1.81
                        ATT | .402127207   .264604253   .137522954   .073833288     1.86
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,052 |    47,052 
   Treated |       344 |       344 
-----------+-----------+----------
     Total |    47,396 |    47,396 
r; t=17.94 22:21:32

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .28295      6.6 |   0.89  0.375 |  0.80*
longcreditpc07          | .30333   .28518      4.5 |   0.58  0.560 |  0.99
cae3                    |  38220    37793      2.1 |   0.30  0.768 |  0.93
age07                   | 23.552   24.174     -5.5 |  -0.71  0.476 |  0.74*
debtassetr07            | .24311   .24879     -1.7 |  -0.31  0.760 |  0.49*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.94    0.857      4.1       4.5      10.6    0.85      60
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.63 22:21:39

. 
. *LABOR PROD
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod1318) logit neighbor(5) caliper(0.001) co
> mmon ties ai(14)

Logistic regression                             Number of obs     =     47,729
                                                LR chi2(5)        =      82.22
                                                Prob > chi2       =     0.0000
Log likelihood = -2008.3238                     Pseudo R2         =     0.0201

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1248681   .2297712     0.54   0.587    -.3254751    .5752113
longcreditpc07 |   .2987633   .1316803     2.27   0.023     .0406747    .5568518
          cae3 |  -.0000217   2.56e-06    -8.48   0.000    -.0000267   -.0000167
         age07 |  -.0044101   .0047197    -0.93   0.350    -.0136605    .0048404
  debtassetr07 |   -.023207   .1449163    -0.16   0.873    -.3072376    .2608237
         _cons |  -3.993691   .1861726   -21.45   0.000    -4.358583   -3.628799
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   laborprod1318  Unmatched | .037542837    .09939977  -.061856933   .029727243    -2.08
                        ATT | .037542837   .123131492  -.085588655   .032723231    -2.62
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,383 |    47,383 
   Treated |       346 |       346 
-----------+-----------+----------
     Total |    47,729 |    47,729 
r; t=18.39 22:21:57

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589   .27277     10.1 |   1.40  0.162 |  0.94
longcreditpc07          |  .2961   .26664      7.4 |   0.97  0.333 |  1.04
cae3                    |  37927    37242      3.4 |   0.48  0.633 |  0.93
age07                   | 23.402   24.144     -6.6 |  -0.87  0.384 |  0.79*
debtassetr07            | .24454   .23984      1.3 |   0.23  0.815 |  0.39*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.75    0.586      5.8       6.6      14.7    0.92      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.93 22:22:04

. 
. *TFP LEVPET
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP1318) logit neighbor(5) caliper(0.001) co
> mmon ties ai(14)

Logistic regression                             Number of obs     =     45,033
                                                LR chi2(5)        =      74.19
                                                Prob > chi2       =     0.0000
Log likelihood = -1962.9286                     Pseudo R2         =     0.0185

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0160685   .2342249    -0.07   0.945    -.4751409    .4430039
longcreditpc07 |   .3008215   .1325519     2.27   0.023     .0410244    .5606185
          cae3 |  -.0000208   2.57e-06    -8.07   0.000    -.0000258   -.0000157
         age07 |  -.0044578   .0047358    -0.94   0.347    -.0137399    .0048243
  debtassetr07 |  -.0084631   .1568564    -0.05   0.957    -.3158959    .2989698
         _cons |  -3.958654   .1883282   -21.02   0.000    -4.327771   -3.589538
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   levpetTFP1318  Unmatched | .005421015   .000947112   .004473903   .001805932     2.48
                        ATT | .005421015   .002514686   .002906329   .002020039     1.44
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    44,693 |    44,693 
   Treated |       340 |       340 
-----------+-----------+----------
     Total |    45,033 |    45,033 
r; t=17.69 22:22:22

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .27343     10.7 |   1.48  0.138 |  0.97
longcreditpc07          | .30133    .2758      6.4 |   0.82  0.411 |  1.01
cae3                    |  37971    37510      2.3 |   0.32  0.751 |  0.92
age07                   | 23.512   24.028     -4.6 |  -0.61  0.543 |  0.84
debtassetr07            | .24417   .24477     -0.2 |  -0.03  0.975 |  0.43*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.33    0.649      4.8       4.6      14.0    0.98      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.83 22:22:29

. 
. *EMPLOYMENT
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1318) logit neighbor(5) caliper(0.001) c
> ommon ties ai(14)

Logistic regression                             Number of obs     =     48,712
                                                LR chi2(5)        =      82.45
                                                Prob > chi2       =     0.0000
Log likelihood = -2025.1617                     Pseudo R2         =     0.0200

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .0948394   .2287639     0.41   0.678    -.3535297    .5432084
longcreditpc07 |   .3072734   .1315711     2.34   0.020     .0493987     .565148
          cae3 |  -.0000216   2.55e-06    -8.49   0.000    -.0000266   -.0000167
         age07 |  -.0046492   .0046993    -0.99   0.322    -.0138596    .0045612
  debtassetr07 |  -.0503745   .1599363    -0.31   0.753    -.3638439     .263095
         _cons |  -3.991129   .1856192   -21.50   0.000    -4.354936   -3.627322
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  employment1318  Unmatched | .201286027   .148281867    .05300416    .02767192     1.92
                        ATT | .201286027   .135337656    .06594837   .029452201     2.24
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    48,364 |    48,364 
   Treated |       348 |       348 
-----------+-----------+----------
     Total |    48,712 |    48,712 
r; t=17.90 22:22:47

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .28251      5.2 |   0.71  0.476 |  0.88
longcreditpc07          | .29727   .26961      6.9 |   0.90  0.367 |  1.01
cae3                    |  37966    37577      1.9 |   0.27  0.786 |  0.91
age07                   | 23.411   23.283      1.1 |   0.15  0.877 |  0.88
debtassetr07            | .24328   .23086      3.5 |   0.68  0.494 |  0.53*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.57    0.905      3.7       3.5       9.5    0.79      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.81 22:22:53

. 
. *WAGES
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages1318) logit neighbor(5) caliper(0.001) com
> mon ties ai(14)

Logistic regression                             Number of obs     =     45,433
                                                LR chi2(5)        =      76.49
                                                Prob > chi2       =     0.0000
Log likelihood = -1959.9048                     Pseudo R2         =     0.0191

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1069661   .2328801     0.46   0.646    -.3494706    .5634028
longcreditpc07 |    .330467   .1327455     2.49   0.013     .0702906    .5906434
          cae3 |  -.0000209   2.58e-06    -8.09   0.000    -.0000259   -.0000158
         age07 |   -.004848   .0047471    -1.02   0.307    -.0141522    .0044561
  debtassetr07 |  -.0467747   .1628573    -0.29   0.774    -.3659691    .2724196
         _cons |  -3.989954   .1884462   -21.17   0.000    -4.359302   -3.620606
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    avgwages1318  Unmatched |  .16585781   .184365206  -.018507395   .026116338    -0.71
                        ATT |  .16585781   .196157439  -.030299628   .025966458    -1.17
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    45,094 |    45,094 
   Treated |       339 |       339 
-----------+-----------+----------
     Total |    45,433 |    45,433 
r; t=17.96 22:23:11

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .28181      6.4 |   0.86  0.390 |  0.86
longcreditpc07          | .30348   .28442      4.8 |   0.61  0.544 |  0.99
cae3                    |  37992    37517      2.3 |   0.33  0.744 |  0.93
age07                   | 23.537   23.931     -3.5 |  -0.46  0.649 |  0.79*
debtassetr07            | .24136   .24435     -0.8 |  -0.08  0.938 |  0.08*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.001      1.40    0.925      3.6       3.5       9.1    0.87      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.45 22:23:18

. 
. 
. *EBITDA
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318) logit neighbor(5) caliper(0.001) commo
> n ties ai(14)

Logistic regression                             Number of obs     =     46,817
                                                LR chi2(5)        =      74.38
                                                Prob > chi2       =     0.0000
Log likelihood = -1926.7631                     Pseudo R2         =     0.0189

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1125562   .2325204     0.48   0.628    -.3431754    .5682879
longcreditpc07 |   .2962204   .1356177     2.18   0.029     .0304146    .5620262
          cae3 |   -.000021   2.60e-06    -8.08   0.000    -.0000261   -.0000159
         age07 |  -.0067377   .0049551    -1.36   0.174    -.0164496    .0029742
  debtassetr07 |  -.0831817   .1789018    -0.46   0.642    -.4338228    .2674595
         _cons |  -3.973149    .191998   -20.69   0.000    -4.349459    -3.59684
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      ebitda1318  Unmatched | .250813398   .267501584  -.016688186   .060104219    -0.28
                        ATT | .250813398   .296565759  -.045752361   .054920929    -0.83
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    46,487 |    46,487 
   Treated |       330 |       330 
-----------+-----------+----------
     Total |    46,817 |    46,817 
r; t=19.15 22:23:37

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779    .2865      4.9 |   0.65  0.519 |  0.83
longcreditpc07          | .29616   .26835      7.0 |   0.88  0.377 |  1.00
cae3                    |  38382    38066      1.6 |   0.22  0.829 |  0.92
age07                   | 23.124   22.812      2.8 |   0.37  0.710 |  0.82
debtassetr07            | .24138   .23214      2.6 |   0.44  0.661 |  0.36*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.001      1.33    0.932      3.8       2.8       9.0    0.85      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.00 22:23:44

. 
. ********* NO REPLACEMENT **********
. ********* NO REPLACEMENT **********
. ********* NO REPLACEMENT **********
. * Financing
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) logit neighbor(1) caliper(0.001) common
>  ties ai(14) noreplacement

Logistic regression                             Number of obs     =     23,498
                                                LR chi2(5)        =      48.42
                                                Prob > chi2       =     0.0000
Log likelihood = -1476.7812                     Pseudo R2         =     0.0161

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.2177492   .2615744    -0.83   0.405    -.7304256    .2949272
longcreditpc07 |   .1609716   .1486454     1.08   0.279    -.1303679    .4523112
          cae3 |  -.0000194   2.96e-06    -6.55   0.000    -.0000252   -.0000136
         age07 |   -.000236   .0051232    -0.05   0.963    -.0102774    .0098053
  debtassetr07 |  -.2807261   .2469456    -1.14   0.256    -.7647305    .2032783
         _cons |  -3.521446    .214183   -16.44   0.000    -3.941237   -3.101655
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       financing  Unmatched | .451907135   .194649627   .257257507   .088745501     2.90
                        ATT | .451907135   .424479528   .027427606   .119857929     0.23
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    23,222 |    23,222 
   Treated |       276 |       276 
-----------+-----------+----------
     Total |    23,498 |    23,498 
r; t=13.56 22:23:57

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .27534     11.8 |   1.49  0.136 |  0.96
longcreditpc07          | .32695   .28784      9.5 |   1.13  0.260 |  1.07
cae3                    |  37802    37807     -0.0 |  -0.00  0.997 |  0.97
age07                   | 23.786   25.779    -17.9 |  -1.89  0.060 |  0.59*
debtassetr07            | .25434   .25105      1.0 |   0.18  0.853 |  0.81
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.009      7.15    0.210      8.0       9.5      22.7    0.71      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.62 22:24:04

. 
. *TOTAL ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit neighbor(1) caliper(0.001) common ties ai(1
> 4) noreplacement

Logistic regression                             Number of obs     =     52,772
                                                LR chi2(4)        =      82.15
                                                Prob > chi2       =     0.0000
Log likelihood = -2083.3085                     Pseudo R2         =     0.0193

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1197925   .2221053     0.54   0.590    -.3155259     .555111
longcreditpc07 |   .3071381   .1279497     2.40   0.016     .0563612     .557915
          cae3 |  -.0000213   2.52e-06    -8.47   0.000    -.0000263   -.0000164
         age07 |  -.0037951   .0046019    -0.82   0.410    -.0128146    .0052244
         _cons |   -4.10162   .1801391   -22.77   0.000    -4.454686   -3.748554
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    t_assets1318  Unmatched | .316437627   .224222756   .092214871   .035600443     2.59
                        ATT | .316437627   .206785151   .109652475   .041064782     2.67
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    52,418 |    52,418 
   Treated |       354 |       354 
-----------+-----------+----------
     Total |    52,772 |    52,772 
r; t=19.17 22:24:23

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .27473      8.0 |   1.12  0.264 |  0.91
longcreditpc07          | .29759   .26097      9.2 |   1.22  0.224 |  1.06
cae3                    |  38264    37525      3.7 |   0.52  0.601 |  0.94
age07                   |  23.41   24.017     -5.4 |  -0.74  0.459 |  0.86
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.63    0.459      6.6       6.7      14.3    1.02       0
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=5.98 22:24:29

.  
. *FIXED ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets1318) logit neighbor(1) caliper(0.001) com
> mon ties ai(14) noreplacement

Logistic regression                             Number of obs     =     47,396
                                                LR chi2(5)        =      73.87
                                                Prob > chi2       =     0.0000
Log likelihood = -2000.2397                     Pseudo R2         =     0.0181

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0135032   .2302872    -0.06   0.953    -.4648578    .4378514
longcreditpc07 |   .3190963    .132046     2.42   0.016     .0602909    .5779018
          cae3 |  -.0000205   2.55e-06    -8.03   0.000    -.0000255   -.0000155
         age07 |  -.0043119   .0046719    -0.92   0.356    -.0134687     .004845
  debtassetr07 |  -.0845762   .1806224    -0.47   0.640    -.4385897    .2694373
         _cons |   -3.99814   .1869652   -21.38   0.000    -4.364585   -3.631695
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    f_assets1318  Unmatched | .402127207   .264362226   .137764981   .075933176     1.81
                        ATT | .402127207   .256263463   .145863744    .09535404     1.53
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,052 |    47,052 
   Treated |       344 |       344 
-----------+-----------+----------
     Total |    47,396 |    47,396 
r; t=17.78 22:24:47

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983    .2787      8.5 |   1.14  0.254 |  0.82
longcreditpc07          | .30333   .28461      4.7 |   0.60  0.548 |  0.98
cae3                    |  38220    37909      1.5 |   0.22  0.829 |  0.94
age07                   | 23.552    23.86     -2.7 |  -0.38  0.706 |  0.94
debtassetr07            | .24311   .23531      2.3 |   0.45  0.651 |  0.62*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.85    0.870      3.9       2.7      10.4    0.81      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.68 22:24:54

.  
. *LABOR PROD
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod1318) logit neighbor(1) caliper(0.001) co
> mmon ties ai(14) noreplacement

Logistic regression                             Number of obs     =     47,729
                                                LR chi2(5)        =      82.22
                                                Prob > chi2       =     0.0000
Log likelihood = -2008.3238                     Pseudo R2         =     0.0201

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1248681   .2297712     0.54   0.587    -.3254751    .5752113
longcreditpc07 |   .2987633   .1316803     2.27   0.023     .0406747    .5568518
          cae3 |  -.0000217   2.56e-06    -8.48   0.000    -.0000267   -.0000167
         age07 |  -.0044101   .0047197    -0.93   0.350    -.0136605    .0048404
  debtassetr07 |   -.023207   .1449163    -0.16   0.873    -.3072376    .2608237
         _cons |  -3.993691   .1861726   -21.45   0.000    -4.358583   -3.628799
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   laborprod1318  Unmatched | .037542837    .09939977  -.061856933   .029727243    -2.08
                        ATT | .037542837   .109483866  -.071941029   .041919196    -1.72
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,383 |    47,383 
   Treated |       346 |       346 
-----------+-----------+----------
     Total |    47,729 |    47,729 
r; t=18.06 22:25:12

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589   .26793     12.2 |   1.69  0.091 |  0.94
longcreditpc07          |  .2961   .27744      4.7 |   0.61  0.544 |  0.99
cae3                    |  37927    37377      2.7 |   0.38  0.702 |  0.92
age07                   | 23.402   24.064     -5.9 |  -0.76  0.448 |  0.73*
debtassetr07            | .24454   .24229      0.6 |   0.13  0.900 |  0.56*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.75    0.586      5.2       4.7      14.7    0.88      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.90 22:25:19

. 
. *TFP LEVPET
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP1318) logit neighbor(1) caliper(0.001) co
> mmon ties ai(14) noreplacement

Logistic regression                             Number of obs     =     45,033
                                                LR chi2(5)        =      74.19
                                                Prob > chi2       =     0.0000
Log likelihood = -1962.9286                     Pseudo R2         =     0.0185

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0160685   .2342249    -0.07   0.945    -.4751409    .4430039
longcreditpc07 |   .3008215   .1325519     2.27   0.023     .0410244    .5606185
          cae3 |  -.0000208   2.57e-06    -8.07   0.000    -.0000258   -.0000157
         age07 |  -.0044578   .0047358    -0.94   0.347    -.0137399    .0048243
  debtassetr07 |  -.0084631   .1568564    -0.05   0.957    -.3158959    .2989698
         _cons |  -3.958654   .1883282   -21.02   0.000    -4.327771   -3.589538
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   levpetTFP1318  Unmatched | .005421015   .000947112   .004473903   .001805932     2.48
                        ATT | .005421015   .002988304   .002432711    .00243748     1.00
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    44,693 |    44,693 
   Treated |       340 |       340 
-----------+-----------+----------
     Total |    45,033 |    45,033 
r; t=18.32 22:25:37

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .28934      3.8 |   0.52  0.601 |  0.97
longcreditpc07          | .30133   .26048     10.2 |   1.33  0.184 |  1.05
cae3                    |  37971    37245      3.6 |   0.50  0.616 |  0.94
age07                   | 23.512   24.162     -5.8 |  -0.75  0.455 |  0.77*
debtassetr07            | .24417   .24876     -1.4 |  -0.23  0.817 |  0.42*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.003      3.29    0.655      4.9       3.8      13.9    1.00      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.64 22:25:44

. 
. *EMPLOYMENT
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1318) logit neighbor(1) caliper(0.001) c
> ommon ties ai(14) noreplacement

Logistic regression                             Number of obs     =     48,712
                                                LR chi2(5)        =      82.45
                                                Prob > chi2       =     0.0000
Log likelihood = -2025.1617                     Pseudo R2         =     0.0200

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .0948394   .2287639     0.41   0.678    -.3535297    .5432084
longcreditpc07 |   .3072734   .1315711     2.34   0.020     .0493987     .565148
          cae3 |  -.0000216   2.55e-06    -8.49   0.000    -.0000266   -.0000167
         age07 |  -.0046492   .0046993    -0.99   0.322    -.0138596    .0045612
  debtassetr07 |  -.0503745   .1599363    -0.31   0.753    -.3638439     .263095
         _cons |  -3.991129   .1856192   -21.50   0.000    -4.354936   -3.627322
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  employment1318  Unmatched | .201286027   .148281867    .05300416    .02767192     1.92
                        ATT | .201286027   .124268813   .077017214   .039167175     1.97
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    48,364 |    48,364 
   Treated |       348 |       348 
-----------+-----------+----------
     Total |    48,712 |    48,712 
r; t=18.07 22:26:02

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .28272      5.1 |   0.69  0.493 |  0.81*
longcreditpc07          | .29727    .2632      8.6 |   1.12  0.264 |  1.03
cae3                    |  37966    37365      3.0 |   0.42  0.675 |  0.91
age07                   | 23.411   23.647     -2.1 |  -0.28  0.781 |  0.79*
debtassetr07            | .24328   .24968     -1.8 |  -0.30  0.761 |  0.34*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.23    0.816      4.1       3.0      11.3    0.90      60
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.71 22:26:08

. 
. *WAGES
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages1318) logit neighbor(1) caliper(0.001) com
> mon ties ai(14) noreplacement

Logistic regression                             Number of obs     =     45,433
                                                LR chi2(5)        =      76.49
                                                Prob > chi2       =     0.0000
Log likelihood = -1959.9048                     Pseudo R2         =     0.0191

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1069661   .2328801     0.46   0.646    -.3494706    .5634028
longcreditpc07 |    .330467   .1327455     2.49   0.013     .0702906    .5906434
          cae3 |  -.0000209   2.58e-06    -8.09   0.000    -.0000259   -.0000158
         age07 |   -.004848   .0047471    -1.02   0.307    -.0141522    .0044561
  debtassetr07 |  -.0467747   .1628573    -0.29   0.774    -.3659691    .2724196
         _cons |  -3.989954   .1884462   -21.17   0.000    -4.359302   -3.620606
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    avgwages1318  Unmatched |  .16585781   .184365206  -.018507395   .026116338    -0.71
                        ATT |  .16585781   .187271691  -.021413881   .033791732    -0.63
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    45,094 |    45,094 
   Treated |       339 |       339 
-----------+-----------+----------
     Total |    45,433 |    45,433 
r; t=17.09 22:26:25

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .27457      9.6 |   1.32  0.187 |  0.96
longcreditpc07          | .30348   .28674      4.2 |   0.53  0.596 |  0.97
cae3                    |  37992    37331      3.3 |   0.46  0.648 |  0.94
age07                   | 23.537   25.171    -14.4 |  -1.77  0.076 |  0.64*
debtassetr07            | .24136   .19895     12.1 |   2.72  0.007 |  0.88
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.012     11.44    0.043      8.7       9.6      26.0*    0.70     20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.75 22:26:32

. 
. *EBITDA
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318) logit neighbor(1) caliper(0.001) commo
> n ties ai(14) noreplacement

Logistic regression                             Number of obs     =     46,817
                                                LR chi2(5)        =      74.38
                                                Prob > chi2       =     0.0000
Log likelihood = -1926.7631                     Pseudo R2         =     0.0189

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1125562   .2325204     0.48   0.628    -.3431754    .5682879
longcreditpc07 |   .2962204   .1356177     2.18   0.029     .0304146    .5620262
          cae3 |   -.000021   2.60e-06    -8.08   0.000    -.0000261   -.0000159
         age07 |  -.0067377   .0049551    -1.36   0.174    -.0164496    .0029742
  debtassetr07 |  -.0831817   .1789018    -0.46   0.642    -.4338228    .2674595
         _cons |  -3.973149    .191998   -20.69   0.000    -4.349459    -3.59684
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      ebitda1318  Unmatched | .250813398   .267501584  -.016688186   .060104219    -0.28
                        ATT | .250813398   .320958045  -.070144647   .074240743    -0.94
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    46,487 |    46,487 
   Treated |       330 |       330 
-----------+-----------+----------
     Total |    46,817 |    46,817 
r; t=17.41 22:26:50

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779   .28312      6.4 |   0.86  0.389 |  0.92
longcreditpc07          | .29616   .26751      7.2 |   0.91  0.362 |  1.00
cae3                    |  38382    38115      1.3 |   0.18  0.855 |  0.93
age07                   | 23.124   22.691      3.9 |   0.53  0.599 |  0.88
debtassetr07            | .24138   .22201      5.5 |   0.83  0.406 |  0.28*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.21    0.819      4.9       5.5      11.6    0.78      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.65 22:26:56

. 
. ************** RADIUS MATCHING 0.001**************
. ************** RADIUS MATCHING 0.001**************
. ************** RADIUS MATCHING 0.001**************
. *Financing
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) logit radius caliper(0.001) common ties
>  ai(14)

Logistic regression                             Number of obs     =     23,498
                                                LR chi2(5)        =      48.42
                                                Prob > chi2       =     0.0000
Log likelihood = -1476.7812                     Pseudo R2         =     0.0161

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.2177492   .2615744    -0.83   0.405    -.7304256    .2949272
longcreditpc07 |   .1609716   .1486454     1.08   0.279    -.1303679    .4523112
          cae3 |  -.0000194   2.96e-06    -6.55   0.000    -.0000252   -.0000136
         age07 |   -.000236   .0051232    -0.05   0.963    -.0102774    .0098053
  debtassetr07 |  -.2807261   .2469456    -1.14   0.256    -.7647305    .2032783
         _cons |  -3.521446    .214183   -16.44   0.000    -3.941237   -3.101655
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       financing  Unmatched | .451907135   .194649627   .257257507   .088745501     2.90
                        ATT | .451907135   .241591791   .210315343   .073881098     2.85
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    23,222 |    23,222 
   Treated |       276 |       276 
-----------+-----------+----------
     Total |    23,498 |    23,498 
r; t=154.67 22:29:31

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .29814      2.0 |   0.24  0.808 |  0.87
longcreditpc07          | .32695   .30032      6.5 |   0.76  0.446 |  1.03
cae3                    |  37802    37690      0.6 |   0.07  0.944 |  0.96
age07                   | 23.786   24.046     -2.3 |  -0.27  0.790 |  0.77*
debtassetr07            | .25434   .25166      0.8 |   0.14  0.887 |  0.68*
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.001      0.72    0.982      2.4       2.0       7.2    0.94      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.79 22:29:38

. 
. *TOTAL ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit radius caliper(0.001) common ties ai(14)

Logistic regression                             Number of obs     =     52,772
                                                LR chi2(4)        =      82.15
                                                Prob > chi2       =     0.0000
Log likelihood = -2083.3085                     Pseudo R2         =     0.0193

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1197925   .2221053     0.54   0.590    -.3155259     .555111
longcreditpc07 |   .3071381   .1279497     2.40   0.016     .0563612     .557915
          cae3 |  -.0000213   2.52e-06    -8.47   0.000    -.0000263   -.0000164
         age07 |  -.0037951   .0046019    -0.82   0.410    -.0128146    .0052244
         _cons |   -4.10162   .1801391   -22.77   0.000    -4.454686   -3.748554
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    t_assets1318  Unmatched | .316437627   .224222756   .092214871   .035600443     2.59
                        ATT | .316437627   .226633161   .089804466   .027044944     3.32
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    52,418 |    52,418 
   Treated |       354 |       354 
-----------+-----------+----------
     Total |    52,772 |    52,772 
r; t=202.09 22:33:00

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .27648      7.2 |   1.00  0.319 |  0.86
longcreditpc07          | .29759   .26434      8.3 |   1.09  0.274 |  1.01
cae3                    |  38264    37958      1.5 |   0.22  0.830 |  0.92
age07                   |  23.41   23.614     -1.8 |  -0.24  0.807 |  0.80*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.15    0.708      4.7       4.5      11.0    0.91      25
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.32 22:33:06

. 
.  *FIXED ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets1318) logit radius caliper(0.001) common t
> ies ai(14)

Logistic regression                             Number of obs     =     47,396
                                                LR chi2(5)        =      73.87
                                                Prob > chi2       =     0.0000
Log likelihood = -2000.2397                     Pseudo R2         =     0.0181

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0135032   .2302872    -0.06   0.953    -.4648578    .4378514
longcreditpc07 |   .3190963    .132046     2.42   0.016     .0602909    .5779018
          cae3 |  -.0000205   2.55e-06    -8.03   0.000    -.0000255   -.0000155
         age07 |  -.0043119   .0046719    -0.92   0.356    -.0134687     .004845
  debtassetr07 |  -.0845762   .1806224    -0.47   0.640    -.4385897    .2694373
         _cons |   -3.99814   .1869652   -21.38   0.000    -4.364585   -3.631695
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    f_assets1318  Unmatched | .402127207   .264362226   .137764981   .075933176     1.81
                        ATT | .402127207   .295674632   .106452575   .066938733     1.59
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,052 |    47,052 
   Treated |       344 |       344 
-----------+-----------+----------
     Total |    47,396 |    47,396 
r; t=192.82 22:36:19

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .28371      6.3 |   0.86  0.390 |  0.87
longcreditpc07          | .30333   .26865      8.7 |   1.12  0.262 |  1.01
cae3                    |  38220    37955      1.3 |   0.18  0.855 |  0.92
age07                   | 23.552   23.664     -1.0 |  -0.13  0.895 |  0.82
debtassetr07            | .24311   .23196      3.3 |   0.59  0.555 |  0.47*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.03    0.845      4.1       3.3      10.9    0.84      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.85 22:36:26

. 
. *LABOR PROD
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod1318) logit radius caliper(0.001) common 
> ties ai(14)

Logistic regression                             Number of obs     =     47,729
                                                LR chi2(5)        =      82.22
                                                Prob > chi2       =     0.0000
Log likelihood = -2008.3238                     Pseudo R2         =     0.0201

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1248681   .2297712     0.54   0.587    -.3254751    .5752113
longcreditpc07 |   .2987633   .1316803     2.27   0.023     .0406747    .5568518
          cae3 |  -.0000217   2.56e-06    -8.48   0.000    -.0000267   -.0000167
         age07 |  -.0044101   .0047197    -0.93   0.350    -.0136605    .0048404
  debtassetr07 |   -.023207   .1449163    -0.16   0.873    -.3072376    .2608237
         _cons |  -3.993691   .1861726   -21.45   0.000    -4.358583   -3.628799
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   laborprod1318  Unmatched | .037542837    .09939977  -.061856933   .029727243    -2.08
                        ATT | .037542837   .104428032  -.066885195   .030272523    -2.21
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,383 |    47,383 
   Treated |       346 |       346 
-----------+-----------+----------
     Total |    47,729 |    47,729 
r; t=192.35 22:39:38

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589   .27902      7.4 |   1.00  0.315 |  0.88
longcreditpc07          |  .2961   .26225      8.5 |   1.11  0.269 |  1.02
cae3                    |  37927    37608      1.6 |   0.22  0.824 |  0.93
age07                   | 23.402   23.572     -1.5 |  -0.20  0.839 |  0.84
debtassetr07            | .24454   .23293      3.3 |   0.53  0.596 |  0.31*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.26    0.812      4.4       3.3      11.4    0.87      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.91 22:39:45

. 
. *TFP LEVPET
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP1318) logit radius caliper(0.001) common 
> ties ai(14)

Logistic regression                             Number of obs     =     45,033
                                                LR chi2(5)        =      74.19
                                                Prob > chi2       =     0.0000
Log likelihood = -1962.9286                     Pseudo R2         =     0.0185

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0160685   .2342249    -0.07   0.945    -.4751409    .4430039
longcreditpc07 |   .3008215   .1325519     2.27   0.023     .0410244    .5606185
          cae3 |  -.0000208   2.57e-06    -8.07   0.000    -.0000258   -.0000157
         age07 |  -.0044578   .0047358    -0.94   0.347    -.0137399    .0048243
  debtassetr07 |  -.0084631   .1568564    -0.05   0.957    -.3158959    .2989698
         _cons |  -3.958654   .1883282   -21.02   0.000    -4.327771   -3.589538
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   levpetTFP1318  Unmatched | .005421015   .000947112   .004473903   .001805932     2.48
                        ATT | .005421015   .001596964   .003824051   .001849548     2.07
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    44,693 |    44,693 
   Treated |       340 |       340 
-----------+-----------+----------
     Total |    45,033 |    45,033 
r; t=190.10 22:42:55

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .28232      6.8 |   0.93  0.354 |  0.89
longcreditpc07          | .30133   .26556      8.9 |   1.16  0.248 |  1.02
cae3                    |  37971    37666      1.5 |   0.21  0.833 |  0.93
age07                   | 23.512   23.632     -1.1 |  -0.14  0.887 |  0.84
debtassetr07            | .24417   .23262      3.5 |   0.54  0.591 |  0.34*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.20    0.820      4.4       3.5      11.4    0.86      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.10 22:43:02

. 
. *EMPLOYMENT
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1318) logit radius caliper(0.001) common
>  ties ai(14)

Logistic regression                             Number of obs     =     48,712
                                                LR chi2(5)        =      82.45
                                                Prob > chi2       =     0.0000
Log likelihood = -2025.1617                     Pseudo R2         =     0.0200

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .0948394   .2287639     0.41   0.678    -.3535297    .5432084
longcreditpc07 |   .3072734   .1315711     2.34   0.020     .0493987     .565148
          cae3 |  -.0000216   2.55e-06    -8.49   0.000    -.0000266   -.0000167
         age07 |  -.0046492   .0046993    -0.99   0.322    -.0138596    .0045612
  debtassetr07 |  -.0503745   .1599363    -0.31   0.753    -.3638439     .263095
         _cons |  -3.991129   .1856192   -21.50   0.000    -4.354936   -3.627322
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  employment1318  Unmatched | .201286027   .148281867    .05300416    .02767192     1.92
                        ATT | .201286027   .153341448   .047944578   .026592019     1.80
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    48,364 |    48,364 
   Treated |       348 |       348 
-----------+-----------+----------
     Total |    48,712 |    48,712 
r; t=195.46 22:46:18

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .27785      7.2 |   0.99  0.322 |  0.88
longcreditpc07          | .29727   .26211      8.8 |   1.15  0.250 |  1.02
cae3                    |  37966    37663      1.5 |   0.21  0.831 |  0.93
age07                   | 23.411   23.557     -1.3 |  -0.18  0.861 |  0.84
debtassetr07            | .24328    .2314      3.3 |   0.59  0.553 |  0.40*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.34    0.801      4.4       3.3      11.6    0.86      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.88 22:46:25

. 
. *WAGES
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages1318) logit radius caliper(0.001) common t
> ies ai(14)

Logistic regression                             Number of obs     =     45,433
                                                LR chi2(5)        =      76.49
                                                Prob > chi2       =     0.0000
Log likelihood = -1959.9048                     Pseudo R2         =     0.0191

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1069661   .2328801     0.46   0.646    -.3494706    .5634028
longcreditpc07 |    .330467   .1327455     2.49   0.013     .0702906    .5906434
          cae3 |  -.0000209   2.58e-06    -8.09   0.000    -.0000259   -.0000158
         age07 |   -.004848   .0047471    -1.02   0.307    -.0141522    .0044561
  debtassetr07 |  -.0467747   .1628573    -0.29   0.774    -.3659691    .2724196
         _cons |  -3.989954   .1884462   -21.17   0.000    -4.359302   -3.620606
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    avgwages1318  Unmatched |  .16585781   .184365206  -.018507395   .026116338    -0.71
                        ATT |  .16585781   .187156002  -.021298192   .023403249    -0.91
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    45,094 |    45,094 
   Treated |       339 |       339 
-----------+-----------+----------
     Total |    45,433 |    45,433 
r; t=189.16 22:49:34

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .28112      6.7 |   0.90  0.366 |  0.88
longcreditpc07          | .30348   .27045      8.3 |   1.06  0.290 |  1.01
cae3                    |  37992    37668      1.6 |   0.22  0.824 |  0.92
age07                   | 23.537   23.615     -0.7 |  -0.09  0.926 |  0.86
debtassetr07            | .24136   .23072      3.0 |   0.53  0.596 |  0.39*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.94    0.858      4.1       3.0      10.7    0.86      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.72 22:49:41

. 
. *EBITDA
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318) logit radius caliper(0.001) common tie
> s ai(14)

Logistic regression                             Number of obs     =     46,817
                                                LR chi2(5)        =      74.38
                                                Prob > chi2       =     0.0000
Log likelihood = -1926.7631                     Pseudo R2         =     0.0189

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1125562   .2325204     0.48   0.628    -.3431754    .5682879
longcreditpc07 |   .2962204   .1356177     2.18   0.029     .0304146    .5620262
          cae3 |   -.000021   2.60e-06    -8.08   0.000    -.0000261   -.0000159
         age07 |  -.0067377   .0049551    -1.36   0.174    -.0164496    .0029742
  debtassetr07 |  -.0831817   .1789018    -0.46   0.642    -.4338228    .2674595
         _cons |  -3.973149    .191998   -20.69   0.000    -4.349459    -3.59684
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      ebitda1318  Unmatched | .250813398   .267501584  -.016688186   .060104219    -0.28
                        ATT | .250813398    .28588739  -.035073992   .048094075    -0.73
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    46,487 |    46,487 
   Treated |       330 |       330 
-----------+-----------+----------
     Total |    46,817 |    46,817 
r; t=186.60 22:52:47

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779    .2802      7.6 |   1.02  0.309 |  0.87
longcreditpc07          | .29616   .26399      8.1 |   1.02  0.306 |  1.01
cae3                    |  38382    38151      1.1 |   0.16  0.873 |  0.94
age07                   | 23.124   23.165     -0.4 |  -0.05  0.961 |  0.86
debtassetr07            | .24138   .22951      3.4 |   0.61  0.544 |  0.45*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.05    0.842      4.1       3.4      11.1    0.85      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.23 22:52:54

. 
. ************** RADIUS MATCHING 0.00001**************
. ************** RADIUS MATCHING 0.00001**************
. ************** RADIUS MATCHING 0.00001**************
. *Financing
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) logit radius caliper(0.00001) common ti
> es ai(14)

Logistic regression                             Number of obs     =     23,498
                                                LR chi2(5)        =      48.42
                                                Prob > chi2       =     0.0000
Log likelihood = -1476.7812                     Pseudo R2         =     0.0161

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.2177492   .2615744    -0.83   0.405    -.7304256    .2949272
longcreditpc07 |   .1609716   .1486454     1.08   0.279    -.1303679    .4523112
          cae3 |  -.0000194   2.96e-06    -6.55   0.000    -.0000252   -.0000136
         age07 |   -.000236   .0051232    -0.05   0.963    -.0102774    .0098053
  debtassetr07 |  -.2807261   .2469456    -1.14   0.256    -.7647305    .2032783
         _cons |  -3.521446    .214183   -16.44   0.000    -3.941237   -3.101655
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       financing  Unmatched | .451907135   .194649627   .257257507   .088745501     2.90
                        ATT |  .45339455   .281905865   .171488686   .077758015     2.21
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |         0     23,222 |    23,222 
   Treated |         1        275 |       276 
-----------+----------------------+----------
     Total |         1     23,497 |    23,498 
r; t=190.61 22:56:05

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30315   .29284      4.4 |   0.55  0.579 |  0.91
longcreditpc07          | .32458   .29823      6.4 |   0.76  0.450 |  1.04
cae3                    |  37884    37809      0.4 |   0.05  0.962 |  0.97
age07                   | 23.756   24.246     -4.4 |  -0.51  0.613 |  0.79
debtassetr07            | .25467   .25233      0.7 |   0.13  0.900 |  0.70*
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.001      1.12    0.952      3.3       4.4       9.0    0.90      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.77 22:56:12

. 
. *TOTAL ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit radius caliper(0.00001) common ties ai(14)

Logistic regression                             Number of obs     =     52,772
                                                LR chi2(4)        =      82.15
                                                Prob > chi2       =     0.0000
Log likelihood = -2083.3085                     Pseudo R2         =     0.0193

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1197925   .2221053     0.54   0.590    -.3155259     .555111
longcreditpc07 |   .3071381   .1279497     2.40   0.016     .0563612     .557915
          cae3 |  -.0000213   2.52e-06    -8.47   0.000    -.0000263   -.0000164
         age07 |  -.0037951   .0046019    -0.82   0.410    -.0128146    .0052244
         _cons |   -4.10162   .1801391   -22.77   0.000    -4.454686   -3.748554
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    t_assets1318  Unmatched | .316437627   .224222756   .092214871   .035600443     2.59
                        ATT | .316437627   .230757807   .085679819   .027490739     3.12
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    52,418 |    52,418 
   Treated |       354 |       354 
-----------+-----------+----------
     Total |    52,772 |    52,772 
r; t=235.76 23:00:08

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .27665      7.2 |   0.99  0.324 |  0.86
longcreditpc07          | .29759   .26893      7.2 |   0.94  0.346 |  1.01
cae3                    |  38264    37722      2.7 |   0.38  0.704 |  0.90
age07                   |  23.41   23.618     -1.9 |  -0.25  0.801 |  0.83
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.95    0.745      4.7       4.9      10.5    0.87       0
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.37 23:00:14

. 
.  *FIXED ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets1318) logit radius caliper(0.00001) common
>  ties ai(14)

Logistic regression                             Number of obs     =     47,396
                                                LR chi2(5)        =      73.87
                                                Prob > chi2       =     0.0000
Log likelihood = -2000.2397                     Pseudo R2         =     0.0181

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0135032   .2302872    -0.06   0.953    -.4648578    .4378514
longcreditpc07 |   .3190963    .132046     2.42   0.016     .0602909    .5779018
          cae3 |  -.0000205   2.55e-06    -8.03   0.000    -.0000255   -.0000155
         age07 |  -.0043119   .0046719    -0.92   0.356    -.0134687     .004845
  debtassetr07 |  -.0845762   .1806224    -0.47   0.640    -.4385897    .2694373
         _cons |   -3.99814   .1869652   -21.38   0.000    -4.364585   -3.631695
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    f_assets1318  Unmatched | .402127207   .264362226   .137764981   .075933176     1.81
                        ATT | .402127207   .299670407     .1024568   .067959553     1.51
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,052 |    47,052 
   Treated |       344 |       344 
-----------+-----------+----------
     Total |    47,396 |    47,396 
r; t=229.40 23:04:03

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .28354      6.4 |   0.87  0.385 |  0.86
longcreditpc07          | .30333   .27911      6.0 |   0.78  0.435 |  1.00
cae3                    |  38220    37820      2.0 |   0.28  0.783 |  0.93
age07                   | 23.552   23.788     -2.1 |  -0.28  0.779 |  0.85
debtassetr07            | .24311   .23886      1.2 |   0.22  0.827 |  0.43*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.45    0.918      3.5       2.1       9.2    0.87      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.70 23:04:10

. 
. *LABOR PROD
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod1318) logit radius caliper(0.00001) commo
> n ties ai(14)

Logistic regression                             Number of obs     =     47,729
                                                LR chi2(5)        =      82.22
                                                Prob > chi2       =     0.0000
Log likelihood = -2008.3238                     Pseudo R2         =     0.0201

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1248681   .2297712     0.54   0.587    -.3254751    .5752113
longcreditpc07 |   .2987633   .1316803     2.27   0.023     .0406747    .5568518
          cae3 |  -.0000217   2.56e-06    -8.48   0.000    -.0000267   -.0000167
         age07 |  -.0044101   .0047197    -0.93   0.350    -.0136605    .0048404
  debtassetr07 |   -.023207   .1449163    -0.16   0.873    -.3072376    .2608237
         _cons |  -3.993691   .1861726   -21.45   0.000    -4.358583   -3.628799
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   laborprod1318  Unmatched | .037542837    .09939977  -.061856933   .029727243    -2.08
                        ATT | .037542837    .10846469  -.070921853   .030672621    -2.31
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,383 |    47,383 
   Treated |       346 |       346 
-----------+-----------+----------
     Total |    47,729 |    47,729 
r; t=275.63 23:08:46

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589    .2783      7.7 |   1.05  0.295 |  0.89
longcreditpc07          |  .2961   .26891      6.8 |   0.89  0.374 |  1.01
cae3                    |  37927    37410      2.6 |   0.36  0.719 |  0.92
age07                   | 23.402   23.665     -2.3 |  -0.31  0.754 |  0.84
debtassetr07            | .24454   .23377      3.0 |   0.53  0.597 |  0.38*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.09    0.836      4.5       3.0      11.0    0.82      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.37 23:08:53

. 
. *TFP LEVPET
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP1318) logit radius caliper(0.00001) commo
> n ties ai(14)

Logistic regression                             Number of obs     =     45,033
                                                LR chi2(5)        =      74.19
                                                Prob > chi2       =     0.0000
Log likelihood = -1962.9286                     Pseudo R2         =     0.0185

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0160685   .2342249    -0.07   0.945    -.4751409    .4430039
longcreditpc07 |   .3008215   .1325519     2.27   0.023     .0410244    .5606185
          cae3 |  -.0000208   2.57e-06    -8.07   0.000    -.0000258   -.0000157
         age07 |  -.0044578   .0047358    -0.94   0.347    -.0137399    .0048243
  debtassetr07 |  -.0084631   .1568564    -0.05   0.957    -.3158959    .2989698
         _cons |  -3.958654   .1883282   -21.02   0.000    -4.327771   -3.589538
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   levpetTFP1318  Unmatched | .005421015   .000947112   .004473903   .001805932     2.48
                        ATT | .005421015   .002078566   .003342449   .001869822     1.79
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    44,693 |    44,693 
   Treated |       340 |       340 
-----------+-----------+----------
     Total |    45,033 |    45,033 
r; t=239.01 23:12:52

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .28101      7.4 |   1.01  0.312 |  0.92
longcreditpc07          | .30133   .27474      6.7 |   0.86  0.391 |  1.01
cae3                    |  37971    37549      2.1 |   0.29  0.772 |  0.92
age07                   | 23.512   23.765     -2.2 |  -0.30  0.764 |  0.86
debtassetr07            | .24417   .23403      3.1 |   0.47  0.640 |  0.33*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.91    0.862      4.3       3.1      10.6    0.84      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.37 23:12:59

. 
. *EMPLOYMENT
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1318) logit radius caliper(0.00001) comm
> on ties ai(14)

Logistic regression                             Number of obs     =     48,712
                                                LR chi2(5)        =      82.45
                                                Prob > chi2       =     0.0000
Log likelihood = -2025.1617                     Pseudo R2         =     0.0200

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .0948394   .2287639     0.41   0.678    -.3535297    .5432084
longcreditpc07 |   .3072734   .1315711     2.34   0.020     .0493987     .565148
          cae3 |  -.0000216   2.55e-06    -8.49   0.000    -.0000266   -.0000167
         age07 |  -.0046492   .0046993    -0.99   0.322    -.0138596    .0045612
  debtassetr07 |  -.0503745   .1599363    -0.31   0.753    -.3638439     .263095
         _cons |  -3.991129   .1856192   -21.50   0.000    -4.354936   -3.627322
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  employment1318  Unmatched | .201286027   .148281867    .05300416    .02767192     1.92
                        ATT | .201286027   .144176087    .05710994   .027022711     2.11
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    48,364 |    48,364 
   Treated |       348 |       348 
-----------+-----------+----------
     Total |    48,712 |    48,712 
r; t=266.35 23:17:26

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449    .2789      6.8 |   0.93  0.354 |  0.87
longcreditpc07          | .29727   .26767      7.4 |   0.97  0.333 |  1.02
cae3                    |  37966    37447      2.6 |   0.36  0.717 |  0.92
age07                   | 23.411   23.684     -2.4 |  -0.33  0.743 |  0.85
debtassetr07            | .24328   .23109      3.4 |   0.63  0.532 |  0.43*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.11    0.834      4.5       3.4      11.0    0.81      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.21 23:17:33

. 
. *WAGES
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages1318) logit radius caliper(0.00001) common
>  ties ai(14)

Logistic regression                             Number of obs     =     45,433
                                                LR chi2(5)        =      76.49
                                                Prob > chi2       =     0.0000
Log likelihood = -1959.9048                     Pseudo R2         =     0.0191

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1069661   .2328801     0.46   0.646    -.3494706    .5634028
longcreditpc07 |    .330467   .1327455     2.49   0.013     .0702906    .5906434
          cae3 |  -.0000209   2.58e-06    -8.09   0.000    -.0000259   -.0000158
         age07 |   -.004848   .0047471    -1.02   0.307    -.0141522    .0044561
  debtassetr07 |  -.0467747   .1628573    -0.29   0.774    -.3659691    .2724196
         _cons |  -3.989954   .1884462   -21.17   0.000    -4.359302   -3.620606
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    avgwages1318  Unmatched |  .16585781   .184365206  -.018507395   .026116338    -0.71
                        ATT |  .16585781   .185885072  -.020027262    .02377718    -0.84
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    45,094 |    45,094 
   Treated |       339 |       339 
-----------+-----------+----------
     Total |    45,433 |    45,433 
r; t=240.14 23:21:33

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .28119      6.7 |   0.90  0.370 |  0.87
longcreditpc07          | .30348   .28044      5.8 |   0.74  0.461 |  1.00
cae3                    |  37992    37511      2.4 |   0.33  0.741 |  0.92
age07                   | 23.537   23.746     -1.8 |  -0.25  0.806 |  0.84
debtassetr07            | .24136   .23681      1.3 |   0.19  0.848 |  0.25*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.45    0.919      3.6       2.4       9.2    0.89      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.91 23:21:40

. 
. *EBITDA
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318) logit radius caliper(0.00001) common t
> ies ai(14)

Logistic regression                             Number of obs     =     46,817
                                                LR chi2(5)        =      74.38
                                                Prob > chi2       =     0.0000
Log likelihood = -1926.7631                     Pseudo R2         =     0.0189

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1125562   .2325204     0.48   0.628    -.3431754    .5682879
longcreditpc07 |   .2962204   .1356177     2.18   0.029     .0304146    .5620262
          cae3 |   -.000021   2.60e-06    -8.08   0.000    -.0000261   -.0000159
         age07 |  -.0067377   .0049551    -1.36   0.174    -.0164496    .0029742
  debtassetr07 |  -.0831817   .1789018    -0.46   0.642    -.4338228    .2674595
         _cons |  -3.973149    .191998   -20.69   0.000    -4.349459    -3.59684
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      ebitda1318  Unmatched | .250813398   .267501584  -.016688186   .060104219    -0.28
                        ATT | .250813398   .283119349  -.032305951   .048803892    -0.66
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    46,487 |    46,487 
   Treated |       330 |       330 
-----------+-----------+----------
     Total |    46,817 |    46,817 
r; t=248.16 23:25:48

. 
. 
.

. *********** KERNEL MATCHING *****************
. *********** KERNEL MATCHING *****************
. *********** KERNEL MATCHING *****************
. 
. * FINANCING
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) logit kernel kerneltype(normal) bwidth(
> 0.06) common ties

Logistic regression                             Number of obs     =     23,498
                                                LR chi2(5)        =      48.42
                                                Prob > chi2       =     0.0000
Log likelihood = -1476.7812                     Pseudo R2         =     0.0161

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.2177492   .2615744    -0.83   0.405    -.7304256    .2949272
longcreditpc07 |   .1609716   .1486454     1.08   0.279    -.1303679    .4523112
          cae3 |  -.0000194   2.96e-06    -6.55   0.000    -.0000252   -.0000136
         age07 |   -.000236   .0051232    -0.05   0.963    -.0102774    .0098053
  debtassetr07 |  -.2807261   .2469456    -1.14   0.256    -.7647305    .2032783
         _cons |  -3.521446    .214183   -16.44   0.000    -3.941237   -3.101655
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       financing  Unmatched | .451907135   .194649627   .257257507   .088745501     2.90
                        ATT | .451907135     .1948752   .257031935     .0727756     3.53
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    23,222 |    23,222 
   Treated |       276 |       276 
-----------+-----------+----------
     Total |    23,498 |    23,498 
r; t=165.93 2:47:54

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .31749     -6.4 |  -0.75  0.455 |  0.72*
longcreditpc07          | .32695   .29814      7.0 |   0.82  0.413 |  1.00
cae3                    |  37802    46526    -43.3 |  -5.09  0.000 |  0.74*
age07                   | 23.786   23.184      5.4 |   0.63  0.526 |  0.85
debtassetr07            | .25434   .27465     -6.3 |  -0.75  0.456 |  0.24*
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.035     26.80    0.000     13.7       6.4      44.3*    0.67     60
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.00 2:48:01

. 
. *TOTAL ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit kernel kerneltype(normal) bwidth(0.06) comm
> on ties

Logistic regression                             Number of obs     =     52,772
                                                LR chi2(4)        =      82.15
                                                Prob > chi2       =     0.0000
Log likelihood = -2083.3085                     Pseudo R2         =     0.0193

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1197925   .2221053     0.54   0.590    -.3155259     .555111
longcreditpc07 |   .3071381   .1279497     2.40   0.016     .0563612     .557915
          cae3 |  -.0000213   2.52e-06    -8.47   0.000    -.0000263   -.0000164
         age07 |  -.0037951   .0046019    -0.82   0.410    -.0128146    .0052244
         _cons |   -4.10162   .1801391   -22.77   0.000    -4.454686   -3.748554
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    t_assets1318  Unmatched | .316437627   .224222756   .092214871   .035600443     2.59
                        ATT | .316437627   .224204165   .092233461   .026622793     3.46
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    52,418 |    52,418 
   Treated |       354 |       354 
-----------+-----------+----------
     Total |    52,772 |    52,772 
r; t=206.22 2:51:27

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .28183      4.9 |   0.65  0.514 |  0.75*
longcreditpc07          | .29759   .23481     15.8 |   2.09  0.037 |  1.07
cae3                    |  38264    48245    -49.6 |  -6.59  0.000 |  0.73*
age07                   |  23.41   23.413     -0.0 |  -0.00  0.997 |  0.76*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.046     45.51    0.000     17.6      10.3      51.7*    0.75     75
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.51 2:51:33

.  
. *FIXED ASSETS
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets1318) logit kernel kerneltype(normal) bwid
> th(0.06)  common ties 

Logistic regression                             Number of obs     =     47,396
                                                LR chi2(5)        =      73.87
                                                Prob > chi2       =     0.0000
Log likelihood = -2000.2397                     Pseudo R2         =     0.0181

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0135032   .2302872    -0.06   0.953    -.4648578    .4378514
longcreditpc07 |   .3190963    .132046     2.42   0.016     .0602909    .5779018
          cae3 |  -.0000205   2.55e-06    -8.03   0.000    -.0000255   -.0000155
         age07 |  -.0043119   .0046719    -0.92   0.356    -.0134687     .004845
  debtassetr07 |  -.0845762   .1806224    -0.47   0.640    -.4385897    .2694373
         _cons |   -3.99814   .1869652   -21.38   0.000    -4.364585   -3.631695
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    f_assets1318  Unmatched | .402127207   .264362226   .137764981   .075933176     1.81
                        ATT | .402127207   .264434354   .137692853   .067292562     2.05
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,052 |    47,052 
   Treated |       344 |       344 
-----------+-----------+----------
     Total |    47,396 |    47,396 
r; t=200.89 2:54:54

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .29652      0.8 |   0.10  0.920 |  0.75*
longcreditpc07          | .30333   .24257     15.2 |   1.99  0.047 |  1.06
cae3                    |  38220    47896    -47.6 |  -6.24  0.000 |  0.73*
age07                   | 23.552   23.599     -0.4 |  -0.05  0.957 |  0.77*
debtassetr07            | .24311   .24402     -0.3 |  -0.03  0.972 |  0.20*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.043     40.99    0.000     12.8       0.8      49.7*    0.73     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.96 2:55:01

. 
. *LABOR PROD
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod1318) logit kernel kerneltype(normal) bwi
> dth(0.06) common ties 

Logistic regression                             Number of obs     =     47,729
                                                LR chi2(5)        =      82.22
                                                Prob > chi2       =     0.0000
Log likelihood = -2008.3238                     Pseudo R2         =     0.0201

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1248681   .2297712     0.54   0.587    -.3254751    .5752113
longcreditpc07 |   .2987633   .1316803     2.27   0.023     .0406747    .5568518
          cae3 |  -.0000217   2.56e-06    -8.48   0.000    -.0000267   -.0000167
         age07 |  -.0044101   .0047197    -0.93   0.350    -.0136605    .0048404
  debtassetr07 |   -.023207   .1449163    -0.16   0.873    -.3072376    .2608237
         _cons |  -3.993691   .1861726   -21.45   0.000    -4.358583   -3.628799
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   laborprod1318  Unmatched | .037542837    .09939977  -.061856933   .029727243    -2.08
                        ATT | .037542837   .099447673  -.061904836   .029869331    -2.07
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,383 |    47,383 
   Treated |       346 |       346 
-----------+-----------+----------
     Total |    47,729 |    47,729 
r; t=203.71 2:58:25

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589   .28434      5.0 |   0.66  0.508 |  0.77*
longcreditpc07          |  .2961   .23508     15.4 |   2.02  0.044 |  1.06
cae3                    |  37927    48081    -50.3 |  -6.61  0.000 |  0.72*
age07                   | 23.402   23.467     -0.6 |  -0.08  0.939 |  0.78*
debtassetr07            | .24454   .23747      2.0 |   0.26  0.794 |  0.18*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.048     45.72    0.000     14.6       5.0      52.4*    0.74     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.84 2:58:32

. 
. *TFP LEVPET
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP1318) logit kernel kerneltype(normal) bwi
> dth(0.06) common ties 

Logistic regression                             Number of obs     =     45,033
                                                LR chi2(5)        =      74.19
                                                Prob > chi2       =     0.0000
Log likelihood = -1962.9286                     Pseudo R2         =     0.0185

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0160685   .2342249    -0.07   0.945    -.4751409    .4430039
longcreditpc07 |   .3008215   .1325519     2.27   0.023     .0410244    .5606185
          cae3 |  -.0000208   2.57e-06    -8.07   0.000    -.0000258   -.0000157
         age07 |  -.0044578   .0047358    -0.94   0.347    -.0137399    .0048243
  debtassetr07 |  -.0084631   .1568564    -0.05   0.957    -.3158959    .2989698
         _cons |  -3.958654   .1883282   -21.02   0.000    -4.327771   -3.589538
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   levpetTFP1318  Unmatched | .005421015   .000947112   .004473903   .001805932     2.48
                        ATT | .005421015   .000946305   .004474709   .001854566     2.41
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    44,693 |    44,693 
   Treated |       340 |       340 
-----------+-----------+----------
     Total |    45,033 |    45,033 
r; t=211.13 3:02:03

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .29521      1.2 |   0.16  0.873 |  0.77*
longcreditpc07          | .30133    .2419     14.9 |   1.94  0.053 |  1.06
cae3                    |  37971    47764    -48.2 |  -6.29  0.000 |  0.72*
age07                   | 23.512   23.565     -0.5 |  -0.06  0.951 |  0.78*
debtassetr07            | .24417    .2366      2.3 |   0.30  0.765 |  0.22*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.044     41.39    0.000     13.4       2.3      50.2*    0.72     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.05 3:02:10

. 
. *EMPLOYMENT
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1318) logit kernel kerneltype(normal) bw
> idth(0.06) common ties

Logistic regression                             Number of obs     =     48,712
                                                LR chi2(5)        =      82.45
                                                Prob > chi2       =     0.0000
Log likelihood = -2025.1617                     Pseudo R2         =     0.0200

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .0948394   .2287639     0.41   0.678    -.3535297    .5432084
longcreditpc07 |   .3072734   .1315711     2.34   0.020     .0493987     .565148
          cae3 |  -.0000216   2.55e-06    -8.49   0.000    -.0000266   -.0000167
         age07 |  -.0046492   .0046993    -0.99   0.322    -.0138596    .0045612
  debtassetr07 |  -.0503745   .1599363    -0.31   0.753    -.3638439     .263095
         _cons |  -3.991129   .1856192   -21.50   0.000    -4.354936   -3.627322
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  employment1318  Unmatched | .201286027   .148281867    .05300416    .02767192     1.92
                        ATT | .201286027   .148303024   .052983003   .026845831     1.97
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    48,364 |    48,364 
   Treated |       348 |       348 
-----------+-----------+----------
     Total |    48,712 |    48,712 
r; t=215.40 3:05:45

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .28451      4.3 |   0.57  0.567 |  0.76*
longcreditpc07          | .29727   .23599     15.4 |   2.03  0.043 |  1.07
cae3                    |  37966    48098    -50.2 |  -6.63  0.000 |  0.72*
age07                   | 23.411   23.513     -0.9 |  -0.12  0.905 |  0.77*
debtassetr07            | .24328   .23964      1.0 |   0.13  0.893 |  0.19*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.048     45.99    0.000     14.4       4.3      52.4*    0.73     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.68 3:05:53

. 
. *WAGES
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages1318) logit kernel kerneltype(normal) bwid
> th(0.06) common ties

Logistic regression                             Number of obs     =     45,433
                                                LR chi2(5)        =      76.49
                                                Prob > chi2       =     0.0000
Log likelihood = -1959.9048                     Pseudo R2         =     0.0191

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1069661   .2328801     0.46   0.646    -.3494706    .5634028
longcreditpc07 |    .330467   .1327455     2.49   0.013     .0702906    .5906434
          cae3 |  -.0000209   2.58e-06    -8.09   0.000    -.0000259   -.0000158
         age07 |   -.004848   .0047471    -1.02   0.307    -.0141522    .0044561
  debtassetr07 |  -.0467747   .1628573    -0.29   0.774    -.3659691    .2724196
         _cons |  -3.989954   .1884462   -21.17   0.000    -4.359302   -3.620606
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    avgwages1318  Unmatched |  .16585781   .184365206  -.018507395   .026116338    -0.71
                        ATT |  .16585781   .184373611  -.018515801   .023033879    -0.80
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    45,094 |    45,094 
   Treated |       339 |       339 
-----------+-----------+----------
     Total |    45,433 |    45,433 
r; t=199.82 3:09:13

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .28582      4.7 |   0.61  0.545 |  0.77*
longcreditpc07          | .30348    .2379     16.4 |   2.13  0.033 |  1.08
cae3                    |  37992    47795    -48.4 |  -6.31  0.000 |  0.72*
age07                   | 23.537   23.689     -1.3 |  -0.18  0.861 |  0.77*
debtassetr07            | .24136   .23644      1.4 |   0.18  0.856 |  0.18*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.045     42.58    0.000     14.4       4.7      51.0*    0.74     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.82 3:09:20

. 
. *EBITDA
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318) logit kernel kerneltype(normal) bwidth
> (0.06) common ties 

Logistic regression                             Number of obs     =     46,817
                                                LR chi2(5)        =      74.38
                                                Prob > chi2       =     0.0000
Log likelihood = -1926.7631                     Pseudo R2         =     0.0189

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1125562   .2325204     0.48   0.628    -.3431754    .5682879
longcreditpc07 |   .2962204   .1356177     2.18   0.029     .0304146    .5620262
          cae3 |   -.000021   2.60e-06    -8.08   0.000    -.0000261   -.0000159
         age07 |  -.0067377   .0049551    -1.36   0.174    -.0164496    .0029742
  debtassetr07 |  -.0831817   .1789018    -0.46   0.642    -.4338228    .2674595
         _cons |  -3.973149    .191998   -20.69   0.000    -4.349459    -3.59684
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      ebitda1318  Unmatched | .250813398   .267501584  -.016688186   .060104219    -0.28
                        ATT | .250813398   .267666322  -.016852924   .048452805    -0.35
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    46,487 |    46,487 
   Treated |       330 |       330 
-----------+-----------+----------
     Total |    46,817 |    46,817 
r; t=205.19 3:12:45

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779   .28744      4.5 |   0.58  0.565 |  0.75*
longcreditpc07          | .29616   .23807     14.6 |   1.87  0.062 |  1.05
cae3                    |  38382    48214    -48.9 |  -6.27  0.000 |  0.71*
age07                   | 23.124   23.494     -3.3 |  -0.43  0.670 |  0.74*
debtassetr07            | .24138   .24049      0.3 |   0.03  0.974 |  0.19*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.046     42.03    0.000     14.3       4.5      51.4*    0.72     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=8.00 3:12:53


r; t=1665.16 3:12:53



. *********** KERNEL MATCHING with Bootstrapping*****************
. *********** KERNEL MATCHING with Bootstrapping*****************
. *********** KERNEL MATCHING with Bootstrapping*****************
. * Financing
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) 
> logit kernel kerneltype(normal) bwidth(0.06) common ties
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     23,498
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(financing) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .2570319   .0720561     3.57   0.000     .1158047    .3982592
------------------------------------------------------------------------------
r; t=697.23 23:37:25

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .31749     -6.4 |  -0.75  0.455 |  0.72*
longcreditpc07          | .32695   .29814      7.0 |   0.82  0.413 |  1.00
cae3                    |  37802    46526    -43.3 |  -5.09  0.000 |  0.74*
age07                   | 23.786   23.184      5.4 |   0.63  0.526 |  0.85
debtassetr07            | .25434   .27465     -6.3 |  -0.75  0.456 |  0.24*
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.035     26.80    0.000     13.7       6.4      44.3*    0.67     60
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.99 23:37:32

. 
. *TOTAL ASSETS
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit kern
> el kerneltype(normal) bwidth(0.06) common ties
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     52,772
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07, outcome(t_assets1318) logit kernel kerneltype(normal) bwidth(0.06)
                    common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .0922335   .0273293     3.37   0.001      .038669    .1457979
------------------------------------------------------------------------------
r; t=1721.21 0:06:14

. 
. pstest collateral07 longcreditpc07 cae3 age07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .28183      4.9 |   0.65  0.514 |  0.75*
longcreditpc07          | .29759   .23481     15.8 |   2.09  0.037 |  1.07
cae3                    |  38264    48245    -49.6 |  -6.59  0.000 |  0.73*
age07                   |  23.41   23.413     -0.0 |  -0.00  0.997 |  0.76*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.046     45.51    0.000     17.6      10.3      51.7*    0.75     75
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.19 0:06:20

.  
. *FIXED ASSETS
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets131
> 8) logit kernel kerneltype(normal) bwidth(0.06)  common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     47,396
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(f_assets1318) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .1376929    .065059     2.12   0.034     .0101796    .2652061
------------------------------------------------------------------------------
r; t=1594.83 0:32:55

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .29652      0.8 |   0.10  0.920 |  0.75*
longcreditpc07          | .30333   .24257     15.2 |   1.99  0.047 |  1.06
cae3                    |  38220    47896    -47.6 |  -6.24  0.000 |  0.73*
age07                   | 23.552   23.599     -0.4 |  -0.05  0.957 |  0.77*
debtassetr07            | .24311   .24402     -0.3 |  -0.03  0.972 |  0.20*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.043     40.99    0.000     12.8       0.8      49.7*    0.73     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=8.85 0:33:03

. 
. *LABOR PROD
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod13
> 18) logit kernel kerneltype(normal) bwidth(0.06) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     47,729
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(laborprod1318) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.0619048   .0307319    -2.01   0.044    -.1221382   -.0016715
------------------------------------------------------------------------------
r; t=1512.04 0:58:16

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589   .28434      5.0 |   0.66  0.508 |  0.77*
longcreditpc07          |  .2961   .23508     15.4 |   2.02  0.044 |  1.06
cae3                    |  37927    48081    -50.3 |  -6.61  0.000 |  0.72*
age07                   | 23.402   23.467     -0.6 |  -0.08  0.939 |  0.78*
debtassetr07            | .24454   .23747      2.0 |   0.26  0.794 |  0.18*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.048     45.72    0.000     14.6       5.0      52.4*    0.74     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.18 0:58:23

.

. *TFP LEVPET
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP13
> 18) logit kernel kerneltype(normal) bwidth(0.06) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     45,033
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(levpetTFP1318) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |   .0044747   .0017096     2.62   0.009      .001124    .0078255
------------------------------------------------------------------------------
r; t=1478.60 1:28:08

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .29521      1.2 |   0.16  0.873 |  0.77*
longcreditpc07          | .30133    .2419     14.9 |   1.94  0.053 |  1.06
cae3                    |  37971    47764    -48.2 |  -6.29  0.000 |  0.72*
age07                   | 23.512   23.565     -0.5 |  -0.06  0.951 |  0.78*
debtassetr07            | .24417    .2366      2.3 |   0.30  0.765 |  0.22*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.044     41.39    0.000     13.4       2.3      50.2*    0.72     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.84 1:28:15

. 
. *EMPLOYMENT
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1
> 318) logit kernel kerneltype(normal) bwidth(0.06) common ties
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     48,712
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(employment1318) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |    .052983   .0254223     2.08   0.037     .0031563    .1028097
------------------------------------------------------------------------------
r; t=1655.67 1:55:50

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .28451      4.3 |   0.57  0.567 |  0.76*
longcreditpc07          | .29727   .23599     15.4 |   2.03  0.043 |  1.07
cae3                    |  37966    48098    -50.2 |  -6.63  0.000 |  0.72*
age07                   | 23.411   23.513     -0.9 |  -0.12  0.905 |  0.77*
debtassetr07            | .24328   .23964      1.0 |   0.13  0.893 |  0.19*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.048     45.99    0.000     14.4       4.3      52.4*    0.73     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.87 1:55:57

. 
. *WAGES
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages131
> 8) logit kernel kerneltype(normal) bwidth(0.06) common ties
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     45,433
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(avgwages1318) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.0185158   .0198282    -0.93   0.350    -.0573783    .0203467
------------------------------------------------------------------------------
r; t=1446.14 2:20:03

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .28582      4.7 |   0.61  0.545 |  0.77*
longcreditpc07          | .30348    .2379     16.4 |   2.13  0.033 |  1.08
cae3                    |  37992    47795    -48.4 |  -6.31  0.000 |  0.72*
age07                   | 23.537   23.689     -1.3 |  -0.18  0.861 |  0.77*
debtassetr07            | .24136   .23644      1.4 |   0.18  0.856 |  0.18*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.045     42.58    0.000     14.4       4.7      51.0*    0.74     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=8.26 2:20:12

. 
. *EBITDA
. bootstrap r(att), reps(200) level(95): psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318)
>  logit kernel kerneltype(normal) bwidth(0.06) common ties 
(running psmatch2 on estimation sample)

Bootstrap replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Bootstrap results                               Number of obs     =     46,817
                                                Replications      =        200

      command:  psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07, outcome(ebitda1318) logit kernel kerneltype(normal)
                    bwidth(0.06) common ties
        _bs_1:  r(att)

------------------------------------------------------------------------------
             |   Observed   Bootstrap                         Normal-based
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _bs_1 |  -.0168529   .0457687    -0.37   0.713    -.1065579     .072852
------------------------------------------------------------------------------
r; t=1471.17 2:44:43

. 
. pstest collateral07 longcreditpc07 cae3 age07 debtassetr07

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779   .28744      4.5 |   0.58  0.565 |  0.75*
longcreditpc07          | .29616   .23807     14.6 |   1.87  0.062 |  1.05
cae3                    |  38382    48214    -48.9 |  -6.27  0.000 |  0.71*
age07                   | 23.124   23.494     -3.3 |  -0.43  0.670 |  0.74*
debtassetr07            | .24138   .24049      0.3 |   0.03  0.974 |  0.19*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.046     42.03    0.000     14.3       4.5      51.4*    0.72     80
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.14 2:44:50

. 


r; t=6080.71 2:44:50


. do "/bplimext/calctmp/SD92403.000000"

. 
. 
. *************** USING TEFFECTS ai2**************
. *************** USING TEFFECTS ai2**************
. *************** USING TEFFECTS ai2**************
. 
. 
. * FINANCING
. teffects psmatch (financing) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(2)

Treatment-effects estimation                   Number of obs      =     23,498
Estimator      : propensity-score matching     Matches: requested =          2
Outcome model  : matching                                     min =          2
Treatment model: logit                                        max =          2
------------------------------------------------------------------------------
             |              AI Robust
   financing |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .2009384   .1019999     1.97   0.049     .0010223    .4008545
------------------------------------------------------------------------------
r; t=109.77 3:15:30

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       23,498          552
                          Treated obs   =          276          276
                          Control obs   =       23,222          276
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |  -.0651234    .1225998       .721881    1.00032
   longcreditpc07 |   .0697124    .0890329       1.00658   1.040885
             cae3 |  -.4340353   -.0078859      .7377666   .9796093
            age07 |   .0542568   -.0676287      .8520295   .7676575
     debtassetr07 |  -.0641467    .0555346      .2346921   .8378021
  -----------------------------------------------------------------
r; t=114.80 3:17:25

. 
. * TOTAL ASSETS
. teffects psmatch (t_assets1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1)

Treatment-effects estimation                   Number of obs      =     52,772
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          2
------------------------------------------------------------------------------
             |              AI Robust
t_assets1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .0804357   .0437281     1.84   0.066    -.0052698    .1661412
------------------------------------------------------------------------------
r; t=271.52 3:21:56

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       52,772          708
                          Treated obs   =          354          354
                          Control obs   =       52,418          354
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |    .048595     .156093      .7546317     .90433
   longcreditpc07 |   .1573535     .061327      1.073492    .984865
             cae3 |  -.4955452    .0264662      .7279893   .8951721
            age07 |  -.0002365   -.0158139       .766529   .7630984
     debtassetr07 |  -.0210936    .0946518      .1560379   .7565614
  -----------------------------------------------------------------
r; t=269.73 3:26:26

. 
. * FIXED ASSETS
. teffects psmatch (f_assets1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1)

Treatment-effects estimation                   Number of obs      =     47,396
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
f_assets1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .1201814   .0920256     1.31   0.192    -.0601854    .3005482
------------------------------------------------------------------------------
r; t=252.14 3:30:38

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       47,396          688
                          Treated obs   =          344          344
                          Control obs   =       47,052          344
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0071137    .0845712      .7521153   .8257589
   longcreditpc07 |   .1514663    .0408652      1.062342   .9731955
             cae3 |  -.4761745      .01517      .7253871   .9336719
            age07 |  -.0040498   -.0290517      .7684309   .9410672
     debtassetr07 |  -.0028698    .0275959      .1995856   .6238959
  -----------------------------------------------------------------
r; t=255.27 3:34:53

. 
. * LABOR PRODUCTIVITY
. teffects psmatch (laborprod1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1)

Treatment-effects estimation                   Number of obs      =     47,729
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          3
------------------------------------------------------------------------------
             |              AI Robust
laborpr~1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |  -.0733893    .043473    -1.69   0.091    -.1585947    .0118161
------------------------------------------------------------------------------
r; t=250.10 3:39:03

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       47,729          692
                          Treated obs   =          346          346
                          Control obs   =       47,383          346
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0497376     .133997      .7724738   .9433165
   longcreditpc07 |   .1533703    .0525912       1.06715   .9994685
             cae3 |  -.5027589    .0313216      .7211531   .9124048
            age07 |  -.0057358   -.0582161      .7827406   .7251609
     debtassetr07 |   .0196895    .0121896       .184054   .5590634
  -----------------------------------------------------------------
r; t=254.56 3:43:18

. 
. * TOTAL FACTOR PRODUCTIVITY
. teffects psmatch (levpetTFP1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1)

Treatment-effects estimation                   Number of obs      =     45,033
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
levpetT~1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .0021235   .0024467     0.87   0.385     -.002672     .006919
------------------------------------------------------------------------------
r; t=238.20 3:47:16

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       45,033          680
                          Treated obs   =          340          340
                          Control obs   =       44,693          340
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0115965    .0357803      .7716142   .9616442
   longcreditpc07 |   .1485273    .1052154      1.059607   1.054642
             cae3 |  -.4824073    .0392731      .7167957   .9371909
            age07 |  -.0046623   -.0554578      .7838397    .762676
     debtassetr07 |   .0228163   -.0222534       .221732   .4170627
  -----------------------------------------------------------------
r; t=246.28 3:51:23

. 
. * EMPLOYMENT
. teffects psmatch (employment1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1)

Treatment-effects estimation                   Number of obs      =     48,712
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
employm~1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .0779053   .0386271     2.02   0.044     .0021975    .1536131
------------------------------------------------------------------------------
r; t=252.94 3:55:35

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       48,712          696
                          Treated obs   =          348          348
                          Control obs   =       48,364          348
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0427991    .0457899      .7661512   .8125669
   longcreditpc07 |   .1537352    .0883278      1.069079   1.032468
             cae3 |  -.5023732    .0327923      .7184249   .9108827
            age07 |  -.0090019   -.0226444      .7722308   .7919273
     debtassetr07 |    .010019   -.0252567      .1851482   .3434908
  -----------------------------------------------------------------
r; t=266.74 4:00:02

. 
. * WAGES
. teffects psmatch (avgwages1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1)

Treatment-effects estimation                   Number of obs      =     45,433
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
avgwages1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |  -.0214139   .0330287    -0.65   0.517     -.086149    .0433212
------------------------------------------------------------------------------
r; t=225.67 4:03:48

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       45,433          678
                          Treated obs   =          339          339
                          Control obs   =       45,094          339
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0458815    .1014842      .7707082   .9583907
   longcreditpc07 |   .1638798    .0407863      1.079872   .9703505
             cae3 |  -.4844902    .0351057      .7230308    .938096
            age07 |  -.0133959   -.1362728      .7747595   .6366156
     debtassetr07 |   .0137623    .2091711      .1835832   .8771894
  -----------------------------------------------------------------
r; t=239.32 4:07:47

. 
. * EBITDA
. eststo ebitda_teffects: teffects psmatch (ebitda1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneigh
> bor(1)

Treatment-effects estimation                   Number of obs      =     46,817
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          2
------------------------------------------------------------------------------
             |              AI Robust
  ebitda1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |  -.0804762   .0762639    -1.06   0.291    -.2299506    .0689982
------------------------------------------------------------------------------
r; t=248.65 4:11:56

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       46,817          660
                          Treated obs   =          330          330
                          Control obs   =       46,487          330
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0442148    .0844518      .7525531   .9429146
   longcreditpc07 |   .1457017    .0651055      1.057242   .9979291
             cae3 |  -.4884876    .0141947      .7103087   .9293444
            age07 |  -.0331908    .0401187      .7381126   .9093158
     debtassetr07 |   .0023154    .0580064      .1864783   .2781902
  -----------------------------------------------------------------
r; t=257.92 4:16:14

. 
. *************** USING TEFFECTS ai14**************
. *************** USING TEFFECTS ai14**************
. *************** USING TEFFECTS ai14**************
. 
. 
. * FINANCING
. teffects psmatch (financing) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(2) vce(robust, nn(14)
> )

Treatment-effects estimation                   Number of obs      =     23,498
Estimator      : propensity-score matching     Matches: requested =          2
Outcome model  : matching                                     min =          2
Treatment model: logit                                        max =          2
------------------------------------------------------------------------------
             |              AI Robust
   financing |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .2009384    .100041     2.01   0.045     .0048617    .3970151
------------------------------------------------------------------------------
r; t=126.37 4:18:20

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       23,498          552
                          Treated obs   =          276          276
                          Control obs   =       23,222          276
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |  -.0651234    .1225998       .721881    1.00032
   longcreditpc07 |   .0697124    .0890329       1.00658   1.040885
             cae3 |  -.4340353   -.0078859      .7377666   .9796093
            age07 |   .0542568   -.0676287      .8520295   .7676575
     debtassetr07 |  -.0641467    .0555346      .2346921   .8378021
  -----------------------------------------------------------------
r; t=132.37 4:20:33

. 
. * TOTAL ASSETS
. teffects psmatch (t_assets1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, nn(
> 14))

Treatment-effects estimation                   Number of obs      =     52,772
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          2
------------------------------------------------------------------------------
             |              AI Robust
t_assets1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .0804357   .0438722     1.83   0.067    -.0055522    .1664235
------------------------------------------------------------------------------
r; t=277.00 4:25:10

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       52,772          708
                          Treated obs   =          354          354
                          Control obs   =       52,418          354
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |    .048595     .156093      .7546317     .90433
   longcreditpc07 |   .1573535     .061327      1.073492    .984865
             cae3 |  -.4955452    .0264662      .7279893   .8951721
            age07 |  -.0002365   -.0158139       .766529   .7630984
     debtassetr07 |  -.0210936    .0946518      .1560379   .7565614
  -----------------------------------------------------------------
r; t=290.90 4:30:00

. 
. * FIXED ASSETS
. teffects psmatch (f_assets1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, nn(
> 14))

Treatment-effects estimation                   Number of obs      =     47,396
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
f_assets1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .1201814   .0923119     1.30   0.193    -.0607466    .3011094
------------------------------------------------------------------------------
r; t=250.50 4:34:11

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       47,396          688
                          Treated obs   =          344          344
                          Control obs   =       47,052          344
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0071137    .0845712      .7521153   .8257589
   longcreditpc07 |   .1514663    .0408652      1.062342   .9731955
             cae3 |  -.4761745      .01517      .7253871   .9336719
            age07 |  -.0040498   -.0290517      .7684309   .9410672
     debtassetr07 |  -.0028698    .0275959      .1995856   .6238959
  -----------------------------------------------------------------
r; t=252.93 4:38:24

. 
. * LABOR PRODUCTIVITY
. teffects psmatch (laborprod1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, nn
> (14))

Treatment-effects estimation                   Number of obs      =     47,729
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          3
------------------------------------------------------------------------------
             |              AI Robust
laborpr~1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |  -.0733893   .0435155    -1.69   0.092    -.1586782    .0118996
------------------------------------------------------------------------------
r; t=247.51 4:42:31

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       47,729          692
                          Treated obs   =          346          346
                          Control obs   =       47,383          346
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0497376     .133997      .7724738   .9433165
   longcreditpc07 |   .1533703    .0525912       1.06715   .9994685
             cae3 |  -.5027589    .0313216      .7211531   .9124048
            age07 |  -.0057358   -.0582161      .7827406   .7251609
     debtassetr07 |   .0196895    .0121896       .184054   .5590634
  -----------------------------------------------------------------
r; t=249.36 4:46:41

. 
. * TOTAL FACTOR PRODUCTIVITY
. teffects psmatch (levpetTFP1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, nn
> (14))

Treatment-effects estimation                   Number of obs      =     45,033
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
levpetT~1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .0021235   .0024429     0.87   0.385    -.0026646    .0069116
------------------------------------------------------------------------------
r; t=248.34 4:50:49

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       45,033          680
                          Treated obs   =          340          340
                          Control obs   =       44,693          340
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0115965    .0357803      .7716142   .9616442
   longcreditpc07 |   .1485273    .1052154      1.059607   1.054642
             cae3 |  -.4824073    .0392731      .7167957   .9371909
            age07 |  -.0046623   -.0554578      .7838397    .762676
     debtassetr07 |   .0228163   -.0222534       .221732   .4170627
  -----------------------------------------------------------------
r; t=245.29 4:54:54

. 
. * EMPLOYMENT
. teffects psmatch (employment1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, n
> n(14))

Treatment-effects estimation                   Number of obs      =     48,712
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
employm~1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |   .0779053   .0386655     2.01   0.044     .0021223    .1536884
------------------------------------------------------------------------------
r; t=239.89 4:58:54

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       48,712          696
                          Treated obs   =          348          348
                          Control obs   =       48,364          348
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0427991    .0457899      .7661512   .8125669
   longcreditpc07 |   .1537352    .0883278      1.069079   1.032468
             cae3 |  -.5023732    .0327923      .7184249   .9108827
            age07 |  -.0090019   -.0226444      .7722308   .7919273
     debtassetr07 |    .010019   -.0252567      .1851482   .3434908
  -----------------------------------------------------------------
r; t=266.62 5:03:21

. 
. * WAGES
. teffects psmatch (avgwages1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, nn(
> 14))

Treatment-effects estimation                   Number of obs      =     45,433
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          1
------------------------------------------------------------------------------
             |              AI Robust
avgwages1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |  -.0214139   .0330978    -0.65   0.518    -.0862844    .0434567
------------------------------------------------------------------------------
r; t=230.67 5:07:12

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       45,433          678
                          Treated obs   =          339          339
                          Control obs   =       45,094          339
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0458815    .1014842      .7707082   .9583907
   longcreditpc07 |   .1638798    .0407863      1.079872   .9703505
             cae3 |  -.4844902    .0351057      .7230308    .938096
            age07 |  -.0133959   -.1362728      .7747595   .6366156
     debtassetr07 |   .0137623    .2091711      .1835832   .8771894
  -----------------------------------------------------------------
r; t=249.11 5:11:21

. 
. * EBITDA
. teffects psmatch (ebitda1318) (treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07) if ano==2018, atet nneighbor(1) vce(robust, nn(14
> ))

Treatment-effects estimation                   Number of obs      =     46,817
Estimator      : propensity-score matching     Matches: requested =          1
Outcome model  : matching                                     min =          1
Treatment model: logit                                        max =          2
------------------------------------------------------------------------------
             |              AI Robust
  ebitda1318 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ATET         |
 treat14to17 |
   (1 vs 0)  |  -.0804762   .0760864    -1.06   0.290    -.2296028    .0686504
------------------------------------------------------------------------------
r; t=235.22 5:15:16

. 
. tebalance summarize
note: refitting the model using the generate() option

  Covariate balance summary
                                                   Raw      Matched
                          -----------------------------------------
                          Number of obs =       46,817          660
                          Treated obs   =          330          330
                          Control obs   =       46,487          330
                          -----------------------------------------

  -----------------------------------------------------------------
                  |Standardized differences          Variance ratio
                  |        Raw     Matched           Raw    Matched
  ----------------+------------------------------------------------
     collateral07 |   .0442148    .0844518      .7525531   .9429146
   longcreditpc07 |   .1457017    .0651055      1.057242   .9979291
             cae3 |  -.4884876    .0141947      .7103087   .9293444
            age07 |  -.0331908    .0401187      .7381126   .9093158
     debtassetr07 |   .0023154    .0580064      .1864783   .2781902
  -----------------------------------------------------------------
r; t=253.34 5:19:29

. 
. log close
      name:  <unnamed>
       log:  /bplimext/projects/p068_SilvaSantosGouveia/work_area/Log_4_Robustness.log
  log type:  text
 closed on:  30 Dec 2020, 05:19:29
---------------------------------------------------------------------------------------------------------------------------------------------------
