------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /bplimext/projects/p068_SilvaSantosGouveia/work_area/Log_2_econometrics.log
  log type:  text
 opened on:  22 Dec 2020, 20:46:35
r; t=0.00 20:46:35

. 
. 
. use "/bplimext/projects/p068_SilvaSantosGouveia/work_area/finaldb.dta", clear
(CB Panel 2006-2018 - Ref. 2020_06 - YFRM/Rosto (V01) - Anonymized - PE068)
r; t=0.76 20:46:35

. 
. 
. 
. set more off
r; t=0.00 20:46:35

. 
. xtset tina ano
       panel variable:  tina (unbalanced)
        time variable:  ano, 2006 to 2018, but with gaps
                delta:  1 unit
r; t=2.50 20:46:38

. 
. set seed 636299
r; t=0.00 20:46:38

. 
. 
. *************************** USING PSMATCH2**********************
. *************************** USING PSMATCH2**********************
. *************************** USING PSMATCH2**********************
. 
. // Nearest-neighbor matching with replacement and Abadie Imbens SE
. 
.   
. *OUTCOME VARIABLE: Financing
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(financing) logit neighbor(2) caliper(0.001) common ti
> es ai(14)

Logistic regression                             Number of obs     =     23,498
                                                LR chi2(5)        =      48.42
                                                Prob > chi2       =     0.0000
Log likelihood = -1476.7812                     Pseudo R2         =     0.0161

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.2177492   .2615744    -0.83   0.405    -.7304256    .2949272
longcreditpc07 |   .1609716   .1486454     1.08   0.279    -.1303679    .4523112
          cae3 |  -.0000194   2.96e-06    -6.55   0.000    -.0000252   -.0000136
         age07 |   -.000236   .0051232    -0.05   0.963    -.0102774    .0098053
  debtassetr07 |  -.2807261   .2469456    -1.14   0.256    -.7647305    .2032783
         _cons |  -3.521446    .214183   -16.44   0.000    -3.941237   -3.101655
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
       financing  Unmatched | .451907135   .194649627   .257257507   .088745501     2.90
                        ATT | .451907135   .250968714    .20093842   .103424069     1.94
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    23,222 |    23,222 
   Treated |       276 |       276 
-----------+-----------+----------
     Total |    23,498 |    23,498 
r; t=17.34 20:46:55

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .30269   .27663     11.2 |   1.44  0.150 |  1.00
longcreditpc07          | .32695   .29049      8.8 |   1.05  0.296 |  1.04
cae3                    |  37802    37949     -0.7 |  -0.09  0.926 |  0.98
age07                   | 23.786   24.562     -7.0 |  -0.79  0.427 |  0.77*
debtassetr07            | .25434   .24284      3.6 |   0.65  0.514 |  0.84
------------------------------------------------------------------------------
* if variance ratio outside [0.79; 1.27]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.005      3.74    0.587      6.3       7.0      16.5    0.87      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.03 20:47:02

. ** a lot of companies have no financing in 2007, hence why we have a small treated group here. We match on 2 nn to overcome the problem.
. 
. 
. *OUTCOME VARIABLE: total_assets
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 if ano==2018, outcome(t_assets1318) logit neighbor(1) caliper(0.001) common ties ai(14)

Logistic regression                             Number of obs     =     52,772
                                                LR chi2(4)        =      82.15
                                                Prob > chi2       =     0.0000
Log likelihood = -2083.3085                     Pseudo R2         =     0.0193

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1197925   .2221053     0.54   0.590    -.3155259     .555111
longcreditpc07 |   .3071381   .1279497     2.40   0.016     .0563612     .557915
          cae3 |  -.0000213   2.52e-06    -8.47   0.000    -.0000263   -.0000164
         age07 |  -.0037951   .0046019    -0.82   0.410    -.0128146    .0052244
         _cons |   -4.10162   .1801391   -22.77   0.000    -4.454686   -3.748554
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    t_assets1318  Unmatched | .316437627   .224222756   .092214871   .035600443     2.59
                        ATT | .316437627   .206785151   .109652475   .041144552     2.67
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    52,418 |    52,418 
   Treated |       354 |       354 
-----------+-----------+----------
     Total |    52,772 |    52,772 
r; t=19.54 20:47:22

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29319   .27473      8.0 |   1.12  0.264 |  0.91
longcreditpc07          | .29759   .26097      9.2 |   1.22  0.224 |  1.06
cae3                    |  38264    37525      3.7 |   0.52  0.601 |  0.94
age07                   |  23.41   24.017     -5.4 |  -0.74  0.459 |  0.86
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.63    0.459      6.6       6.7      14.3    1.02       0
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.18 20:47:28

. 
. 
. 
. *OUTCOME VARIABLE: fixed_assets
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(f_assets1318) logit neighbor(1) caliper(0.001) common
>  ties ai(14)

Logistic regression                             Number of obs     =     47,396
                                                LR chi2(5)        =      73.87
                                                Prob > chi2       =     0.0000
Log likelihood = -2000.2397                     Pseudo R2         =     0.0181

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0135032   .2302872    -0.06   0.953    -.4648578    .4378514
longcreditpc07 |   .3190963    .132046     2.42   0.016     .0602909    .5779018
          cae3 |  -.0000205   2.55e-06    -8.03   0.000    -.0000255   -.0000155
         age07 |  -.0043119   .0046719    -0.92   0.356    -.0134687     .004845
  debtassetr07 |  -.0845762   .1806224    -0.47   0.640    -.4385897    .2694373
         _cons |   -3.99814   .1869652   -21.38   0.000    -4.364585   -3.631695
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    f_assets1318  Unmatched | .402127207   .264362226   .137764981   .075933176     1.81
                        ATT | .402127207   .281945835   .120181372   .097245986     1.24
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    47,052 |    47,052 
   Treated |       344 |       344 
-----------+-----------+----------
     Total |    47,396 |    47,396 
r; t=18.62 20:47:47

. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            |  .2983   .27924      8.2 |   1.11  0.268 |  0.83
longcreditpc07          | .30333    .2866      4.2 |   0.54  0.592 |  0.97
cae3                    |  38220    37932      1.4 |   0.20  0.842 |  0.93
age07                   | 23.552   23.863     -2.8 |  -0.38  0.703 |  0.94
debtassetr07            | .24311   .23688      1.8 |   0.36  0.718 |  0.62*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      1.68    0.891      3.7       2.8       9.9    0.83      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.37 20:47:54

. 
. 
. 
. *OUTCOME VARIABLE: laborprod
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(laborprod1318) logit neighbor(1) caliper(0.001) commo
> n ties ai(14) ate

Logistic regression                             Number of obs     =     47,729
                                                LR chi2(5)        =      82.22
                                                Prob > chi2       =     0.0000
Log likelihood = -2008.3238                     Pseudo R2         =     0.0201

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1248681   .2297712     0.54   0.587    -.3254751    .5752113
longcreditpc07 |   .2987633   .1316803     2.27   0.023     .0406747    .5568518
          cae3 |  -.0000217   2.56e-06    -8.48   0.000    -.0000267   -.0000167
         age07 |  -.0044101   .0047197    -0.93   0.350    -.0136605    .0048404
  debtassetr07 |   -.023207   .1449163    -0.16   0.873    -.3072376    .2608237
         _cons |  -3.993691   .1861726   -21.45   0.000    -4.358583   -3.628799
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   laborprod1318  Unmatched | .037542837    .09939977  -.061856933   .029727243    -2.08
                        ATT | .037542837   .110932135  -.073389298    .04295306    -1.71
                        ATU |  .09976989   .064555901  -.035213989   .038693294    -0.91
                        ATE |                          -.035497181   .038545124    -0.92
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,087     46,296 |    47,383 
   Treated |         0        346 |       346 
-----------+----------------------+----------
     Total |     1,087     46,642 |    47,729 
r; t=22.42 20:48:16

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29589    .2668     12.7 |   1.76  0.078 |  0.94
longcreditpc07          |  .2961   .27486      5.3 |   0.69  0.489 |  1.00
cae3                    |  37927    37334      2.9 |   0.41  0.680 |  0.91
age07                   | 23.402   24.069     -5.9 |  -0.77  0.444 |  0.73*
debtassetr07            | .24454   .24169      0.8 |   0.16  0.873 |  0.56*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      4.09    0.537      5.5       5.3      15.4    0.88      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.39 20:48:23

. 
. 
. 
. *OUTCOME VARIABLE: levpetTFP 
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(levpetTFP1318) logit neighbor(1) caliper(0.001) commo
> n ties ai(14)

Logistic regression                             Number of obs     =     45,033
                                                LR chi2(5)        =      74.19
                                                Prob > chi2       =     0.0000
Log likelihood = -1962.9286                     Pseudo R2         =     0.0185

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |  -.0160685   .2342249    -0.07   0.945    -.4751409    .4430039
longcreditpc07 |   .3008215   .1325519     2.27   0.023     .0410244    .5606185
          cae3 |  -.0000208   2.57e-06    -8.07   0.000    -.0000258   -.0000157
         age07 |  -.0044578   .0047358    -0.94   0.347    -.0137399    .0048243
  debtassetr07 |  -.0084631   .1568564    -0.05   0.957    -.3158959    .2989698
         _cons |  -3.958654   .1883282   -21.02   0.000    -4.327771   -3.589538
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
   levpetTFP1318  Unmatched | .005421015   .000947112   .004473903   .001805932     2.48
                        ATT | .005421015   .003297504    .00212351   .002499656     0.85
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    44,693 |    44,693 
   Treated |       340 |       340 
-----------+-----------+----------
     Total |    45,033 |    45,033 
r; t=17.64 20:48:40

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29803   .29027      3.4 |   0.47  0.641 |  0.96
longcreditpc07          | .30133   .25922     10.5 |   1.37  0.171 |  1.05
cae3                    |  37971    37230      3.6 |   0.51  0.609 |  0.94
age07                   | 23.512   24.141     -5.6 |  -0.72  0.470 |  0.76*
debtassetr07            | .24417   .24993     -1.7 |  -0.29  0.772 |  0.42*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.004      3.43    0.633      5.0       3.6      14.2    1.01      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.53 20:48:47

. 
. 
. 
. *OUTCOME VARIABLE: employment
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(employment1318) logit neighbor(1) caliper(0.001) comm
> on ties ai(14)

Logistic regression                             Number of obs     =     48,712
                                                LR chi2(5)        =      82.45
                                                Prob > chi2       =     0.0000
Log likelihood = -2025.1617                     Pseudo R2         =     0.0200

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .0948394   .2287639     0.41   0.678    -.3535297    .5432084
longcreditpc07 |   .3072734   .1315711     2.34   0.020     .0493987     .565148
          cae3 |  -.0000216   2.55e-06    -8.49   0.000    -.0000266   -.0000167
         age07 |  -.0046492   .0046993    -0.99   0.322    -.0138596    .0045612
  debtassetr07 |  -.0503745   .1599363    -0.31   0.753    -.3638439     .263095
         _cons |  -3.991129   .1856192   -21.50   0.000    -4.354936   -3.627322
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
  employment1318  Unmatched | .201286027   .148281867    .05300416    .02767192     1.92
                        ATT | .201286027   .123380717   .077905309   .039397285     1.98
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    48,364 |    48,364 
   Treated |       348 |       348 
-----------+-----------+----------
     Total |    48,712 |    48,712 
r; t=18.60 20:49:06

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29449   .28414      4.5 |   0.60  0.546 |  0.81
longcreditpc07          | .29727    .2618      8.9 |   1.17  0.244 |  1.03
cae3                    |  37966    37346      3.1 |   0.43  0.665 |  0.91
age07                   | 23.411   23.664     -2.2 |  -0.30  0.765 |  0.79*
debtassetr07            | .24328    .2503     -2.0 |  -0.33  0.739 |  0.34*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.23]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.002      2.31    0.805      4.1       3.1      11.5    0.90      40
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=7.42 20:49:13

. 
. 
. 
. *OUTCOME VARIABLE: avg_wages
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(avgwages1318) logit neighbor(1) caliper(0.001) common
>  ties ai(14)

Logistic regression                             Number of obs     =     45,433
                                                LR chi2(5)        =      76.49
                                                Prob > chi2       =     0.0000
Log likelihood = -1959.9048                     Pseudo R2         =     0.0191

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1069661   .2328801     0.46   0.646    -.3494706    .5634028
longcreditpc07 |    .330467   .1327455     2.49   0.013     .0702906    .5906434
          cae3 |  -.0000209   2.58e-06    -8.09   0.000    -.0000259   -.0000158
         age07 |   -.004848   .0047471    -1.02   0.307    -.0141522    .0044561
  debtassetr07 |  -.0467747   .1628573    -0.29   0.774    -.3659691    .2724196
         _cons |  -3.989954   .1884462   -21.17   0.000    -4.359302   -3.620606
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
    avgwages1318  Unmatched |  .16585781   .184365206  -.018507395   .026116338    -0.71
                        ATT |  .16585781   .187271691  -.021413881   .033415036    -0.64
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    45,094 |    45,094 
   Treated |       339 |       339 
-----------+-----------+----------
     Total |    45,433 |    45,433 
r; t=18.47 20:49:31

. 
. pstest

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29647   .27457      9.6 |   1.32  0.187 |  0.96
longcreditpc07          | .30348   .28674      4.2 |   0.53  0.596 |  0.97
cae3                    |  37992    37331      3.3 |   0.46  0.648 |  0.94
age07                   | 23.537   25.171    -14.4 |  -1.77  0.076 |  0.64*
debtassetr07            | .24136   .19895     12.1 |   2.72  0.007 |  0.88
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.012     11.44    0.043      8.7       9.6      26.0*    0.70     20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.77 20:49:38

. 
. 
. 
. 
. *OUTCOME VARIABLE: ebitda
. psmatch2 treat14to17 collateral07 longcreditpc07 cae3 age07 debtassetr07 if ano==2018, outcome(ebitda1318) logit neighbor(1) caliper(0.001) common t
> ies ai(14)

Logistic regression                             Number of obs     =     46,817
                                                LR chi2(5)        =      74.38
                                                Prob > chi2       =     0.0000
Log likelihood = -1926.7631                     Pseudo R2         =     0.0189

--------------------------------------------------------------------------------
   treat14to17 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
  collateral07 |   .1125562   .2325204     0.48   0.628    -.3431754    .5682879
longcreditpc07 |   .2962204   .1356177     2.18   0.029     .0304146    .5620262
          cae3 |   -.000021   2.60e-06    -8.08   0.000    -.0000261   -.0000159
         age07 |  -.0067377   .0049551    -1.36   0.174    -.0164496    .0029742
  debtassetr07 |  -.0831817   .1789018    -0.46   0.642    -.4338228    .2674595
         _cons |  -3.973149    .191998   -20.69   0.000    -4.349459    -3.59684
--------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
      ebitda1318  Unmatched | .250813398   .267501584  -.016688186   .060104219    -0.28
                        ATT | .250813398   .331289609  -.080476211   .075903963    -1.06
----------------------------+-----------------------------------------------------------
Note: Sample S.E.

           | psmatch2:
 psmatch2: |   Common
 Treatment |  support
assignment | On suppor |     Total
-----------+-----------+----------
 Untreated |    46,487 |    46,487 
   Treated |       330 |       330 
-----------+-----------+----------
     Total |    46,817 |    46,817 
r; t=18.49 20:49:57

. 
. 
. pstest 

------------------------------------------------------------------------------
                        |       Mean               |     t-test    |  V(T)/
Variable                | Treated Control    %bias |    t    p>|t| |  V(C)
------------------------+--------------------------+---------------+----------
collateral07            | .29779   .27945      7.9 |   1.08  0.278 |  0.94
longcreditpc07          | .29616   .26986      6.6 |   0.84  0.403 |  1.00
cae3                    |  38382    38116      1.3 |   0.18  0.855 |  0.93
age07                   | 23.124   22.703      3.8 |   0.52  0.606 |  0.91
debtassetr07            | .24138   .22403      4.9 |   0.75  0.456 |  0.28*
------------------------------------------------------------------------------
* if variance ratio outside [0.81; 1.24]

----------------------------------------------------------------------
Ps R2   LR chi2   p>chi2   MeanBias   MedBias      B       R     %Var 
----------------------------------------------------------------------
0.003      2.44    0.785      4.9       4.9      12.2    0.86      20
----------------------------------------------------------------------
* if B>25%, R outside [0.5; 2]
r; t=6.77 20:50:04

. 
. 
. 
. ********* continues on Robustness.do file ***********
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /bplimext/projects/p068_SilvaSantosGouveia/work_area/Log_2_econometrics.log
  log type:  text
 closed on:  22 Dec 2020, 20:50:04
------------------------------------------------------------------------------------------------------------------------------------------------------
